content/lua/tools/ldoc-manual.org
# -*- coding:utf-8-*-
#+TITLE: LDoc manual
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com

* 概述
  [[https://github.com/stevedonovan/LDoc][Ldoc]] 是一个软件文档工具，可以从源代码注释（文档注释）中自动生成 API 文档。它主要针对 Lua 并记录 Lua API，但它也可以用文档注释来解析 C，用于记录用 C 实现的 Lua 模块。

  除不再需要某些解决方法，例如，不再使用 module() 定义 Lua 模块，因为在 Lua 5.2 中已经弃用了，它主要与 LuaDoc 兼容。

  此外，输出与 LuaDoc 非常相似，因为 HTML 模板直接基于 LuaDoc。还可在项目中自定义模板和样式表。LDoc 自带三个主题; =pale= 对应空白， =one= 对应单列输出， =fixed= 对应左侧的固定导航栏。

  可以选择使用 Markdown 来处理文档，这意味着在文档注释中不需要丑陋的 HTML。尽管 C/C++ 扩展模块中函数名称不能从代码本身推断出来，但可以用类似的方式记录 。

  LDoc 可通过传统的函数注释、任何 Markdown 格式的文档以及指定的源码示例提供集成文档。示例和文件中 Lua 源码都将被美化。

  虽然有相当多的命令行选项，但首选是以 Lua 格式编写 =config.ld= 配置文件。按照惯例，如果通过 =ldoc .= 调用 LDoc，它会先读取这个文件。通过这种方式，用户可以使用这个简单的命令就可轻松构建文档。

* 注释约定（Commenting Conventions）
  LDoc 使用 Javadoc 和 LuaDoc 建立的约定记录模块，函数，表和类型。

** 文档注释（doc document）
   只解析文档注释，文档注释用至少 3 个连字符，或者包含至少 3 个连字符的空注释行开头：
   #+BEGIN_SRC lua
--- summary.
-- Description; this can extend over
-- several lines

-----------------
-- This will also do.
   #+END_SRC

   或者使用 Lua 块注释:
   #+BEGIN_SRC lua
--[[--
 Summary. A description
 ...;
]]
   #+END_SRC

   任何模块或脚本都必须以文档注释开头；忽略其他文件将并产生警告。唯一例外的是 module 语句开始的模块。

   如果编码标准包含版权声明，那么 =-B= 标志或 =boilerplate=true= 将使 LDoc 忽略每个模块的第一个注释。

   常见的注释模式如 =-- (text) --= 不在此列，因为它们通常用于面向程序员的文档。

** 标记（Tags）
   所有文档注释都以摘要语句 （summary）开头，以句号或问号（注意是英文格式）结尾。随后是可选的描述。通常，摘要语句将出现在模块内容中。

   在这个描述性文本之后，通常会有一些用 =@= 引入的标记。这些标记遵循 Javadoc 建立的约定，并广泛用于其他语言的工具。

   #+BEGIN_SRC lua
--- Some doc comment
-- @tag1 parameters for first tag
-- @tag2 parameters for the second tag
   #+END_SRC

   标记的顺序并不重要，但应保持一致。

   LDoc 识别的所有标记如下：

   + @module：包含 function 和 table 的 Lua 模块，可在 section 内部。
   + @classmod：类似 =@module= ，但是描述类。
   + @submodule：包含您希望放入指定主模块（master module）的定义的文件。
   + @script：Lua 程序。
   + @author（multiple），copyright，@license，@release：仅用于像 =@module= 这样的项目级标记。
   + @function，@lfunction：模块内的函数。
   + @param：函数的形参（多个）。
   + @return：函数返回值（多个）。
   + @raise：此函数抛出未处理的错误。
   + @local：显式将函数标记为未导出（除非 =--all= ）
   + @see：参考其他文档条目。
   + @usage：函数使用示例。（与 =@module= 共用是有不同含义）。
   + @table：Lua table。
   + @field：table 命名成员。
   + @section： 开始一个命名 section，用于将函数或表分组在一起。
   + @type：描述类的 section。
   + @within：将函数或表放入隐式 section。
   + @fixme，@todo 和 @warning 是批注，是出现在函数内的文档注释。

** 模块
   模块首要的应该是名称和描述。以下是 Lua 5.2 中常用的模块编写方式，顶部带有引入了名称 =@module= 标记：
   #+BEGIN_SRC lua
--- a test module
-- @module test

local test = {}

function test.my_module_function_1()
    ...
end
...
return test
   #+END_SRC

   这将设置名为“test”的模块，其描述为“a test module”。

** 函数
   接下来要描述的是模块中的函数。以下是记录函数的简单示例：
   #+BEGIN_SRC lua
--- foo explodes text.
-- It is a specialized splitting operation on a string.
-- @param text the string
-- @return a table of substrings
function foo (text)
....
end
   #+END_SRC

   还可以显式标记函数名称，这在记录由 C 代码导出的 Lua api 时特别有用：
   #+BEGIN_SRC c
/// A C function which is exported to Lua with another name,
// because the ways of C can be mysterious!
// @function our_nice_function
int _some_function_for_lua(lua_State* l) {
    ....
}
   #+END_SRC
   标记基本上添加了所有无法自动从源代码获取的细节。

