lua/ldoc-manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-13 二 10:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LDoc manual</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">LDoc manual</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga8babd3">1. 概述</a></li>
<li><a href="#org551e542">2. 注释约定（Commenting Conventions）</a>
<ul>
<li><a href="#orgf902871">2.1. 文档注释（doc document）</a></li>
<li><a href="#org201708a">2.2. 标记（Tags）</a></li>
<li><a href="#orgd5d0b79">2.3. 模块</a></li>
<li><a href="#orgd088da8">2.4. 函数</a>
<ul>
<li><a href="#orgcdbde87">2.4.1. 函数参数和返回值</a></li>
</ul>
</li>
<li><a href="#org54e11cc">2.5. 表和常量</a></li>
<li><a href="#org2425019">2.6. 显式指定函数或字段</a></li>
<li><a href="#orgd2bbc86">2.7. 重复标记</a></li>
<li><a href="#orgaa84449">2.8. 模块别名</a></li>
<li><a href="#org6058a84">2.9. 局部函数</a></li>
<li><a href="#org5936d87">2.10. 声明标记另一种方法</a></li>
<li><a href="#orgfdc8581">2.11. 要处理的文件</a></li>
</ul>
</li>
<li><a href="#org3c14250">3. See 引用</a>
<ul>
<li><a href="#org6e7ffae">3.1. Custom @see References</a></li>
</ul>
</li>
<li><a href="#orgbe3291f">4. 模块标记</a></li>
<li><a href="#orgbae3ccc">5. sections</a></li>
<li><a href="#org8d296d9">6. 与 LuaDoc 的区别</a></li>
<li><a href="#orgf3084d8">7. 添加新 tag</a></li>
<li><a href="#org4a5e249">8. 从代码中推断更多</a></li>
<li><a href="#org40889fe">9. 用 C 编写的扩展模块</a></li>
<li><a href="#org6a7b0f2">10. 支持 Moonscript</a></li>
<li><a href="#org627e0b7">11. 基本使用</a></li>
<li><a href="#orgae1fbe1">12. Markdown 支持</a></li>
<li><a href="#org92ff101">13. 处理单个模块</a></li>
<li><a href="#org9000413">14. 获得有关模块的帮助</a></li>
<li><a href="#org9cd4e7a">15. read(s) - read a string representation of a Lua table.</a></li>
<li><a href="#org7b0bff1">16. write(tbl, space, not_clever) - Create a string representation of a Lua table.</a></li>
<li><a href="#orgd31c592">17. dump(t, &#x2026;) - Dump a Lua table out to a file or stdout.</a></li>
<li><a href="#org0360236">18. LDoc 生成的页面的剖析</a></li>
<li><a href="#org140ea7f">19. 自定义页面</a></li>
<li><a href="#org545b105">20. 示例</a></li>
<li><a href="#org9f1208f">21. readme 文件</a></li>
<li><a href="#org6c01a1e">22. 标记修饰符</a></li>
<li><a href="#org12fe14f">23. config.ld 中允许的字段</a></li>
<li><a href="#org4e9db30">24. 注释和搜索标记</a></li>
<li><a href="#org9f9cf5f">25. 生成 HTML</a></li>
<li><a href="#org6f3c54b">26. 内部数据表示</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga8babd3" class="outline-2">
<h2 id="orga8babd3"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/stevedonovan/LDoc">Ldoc</a> 是一个软件文档工具，可以从源代码注释（文档注释）中自动生成 API 文档。它主要针对 Lua 并记录 Lua API，但它也可以用文档注释来解析 C，用于记录用 C 实现的 Lua 模块。
</p>

<p>
除不再需要某些解决方法，例如，不再使用 module() 定义 Lua 模块，因为在 Lua 5.2 中已经弃用了，它主要与 LuaDoc 兼容。
</p>

<p>
此外，输出与 LuaDoc 非常相似，因为 HTML 模板直接基于 LuaDoc。还可在项目中自定义模板和样式表。LDoc 自带三个主题; <code>pale</code> 对应空白， <code>one</code> 对应单列输出， <code>fixed</code> 对应左侧的固定导航栏。
</p>

<p>
可以选择使用 Markdown 来处理文档，这意味着在文档注释中不需要丑陋的 HTML。尽管 C/C++ 扩展模块中函数名称不能从代码本身推断出来，但可以用类似的方式记录 。
</p>

<p>
LDoc 可通过传统的函数注释、任何 Markdown 格式的文档以及指定的源码示例提供集成文档。示例和文件中 Lua 源码都将被美化。
</p>

<p>
虽然有相当多的命令行选项，但首选是以 Lua 格式编写 <code>config.ld</code> 配置文件。按照惯例，如果通过 <code>ldoc .</code> 调用 LDoc，它会先读取这个文件。通过这种方式，用户可以使用这个简单的命令就可轻松构建文档。
</p>
</div>
</div>

<div id="outline-container-org551e542" class="outline-2">
<h2 id="org551e542"><span class="section-number-2">2</span> 注释约定（Commenting Conventions）</h2>
<div class="outline-text-2" id="text-2">
<p>
LDoc 使用 Javadoc 和 LuaDoc 建立的约定记录模块，函数，表和类型。
</p>
</div>

<div id="outline-container-orgf902871" class="outline-3">
<h3 id="orgf902871"><span class="section-number-3">2.1</span> 文档注释（doc document）</h3>
<div class="outline-text-3" id="text-2-1">
<p>
只解析文档注释，文档注释用至少 3 个连字符，或者包含至少 3 个连字符的空注释行开头：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">summary.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">Description; this can extend over</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">several lines</span>

<span style="color: #6c6c6c; font-style: italic;">-----------------</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">This will also do.</span>
</pre>
</div>

<p>
或者使用 Lua 块注释:
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--</span><span style="color: #6c6c6c; font-style: italic;">[[--</span>
<span style="color: #6c6c6c; font-style: italic;"> Summary. A description</span>
<span style="color: #6c6c6c; font-style: italic;"> ...;</span>
<span style="color: #6c6c6c; font-style: italic;">]]</span>
</pre>
</div>

<p>
任何模块或脚本都必须以文档注释开头；忽略其他文件将并产生警告。唯一例外的是 module 语句开始的模块。
</p>

<p>
如果编码标准包含版权声明，那么 <code>-B</code> 标志或 <code>boilerplate=true</code> 将使 LDoc 忽略每个模块的第一个注释。
</p>

<p>
常见的注释模式如 <code>-- (text) --</code> 不在此列，因为它们通常用于面向程序员的文档。
</p>
</div>
</div>

<div id="outline-container-org201708a" class="outline-3">
<h3 id="org201708a"><span class="section-number-3">2.2</span> 标记（Tags）</h3>
<div class="outline-text-3" id="text-2-2">
<p>
所有文档注释都以摘要语句 （summary）开头，以句号或问号（注意是英文格式）结尾。随后是可选的描述。通常，摘要语句将出现在模块内容中。
</p>

<p>
在这个描述性文本之后，通常会有一些用 <code>@</code> 引入的标记。这些标记遵循 Javadoc 建立的约定，并广泛用于其他语言的工具。
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">Some doc comment</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@tag1 parameters for first tag</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@tag2 parameters for the second tag</span>
</pre>
</div>

<p>
标记的顺序并不重要，但应保持一致。
</p>

<p>
LDoc 识别的所有标记如下：
</p>

<ul class="org-ul">
<li>@module：包含 function 和 table 的 Lua 模块，可在 section 内部。</li>
<li>@classmod：类似 <code>@module</code> ，但是描述类。</li>
<li>@submodule：包含您希望放入指定主模块（master module）的定义的文件。</li>
<li>@script：Lua 程序。</li>
<li>@author（multiple），copyright，@license，@release：仅用于像 <code>@module</code> 这样的项目级标记。</li>
<li>@function，@lfunction：模块内的函数。</li>
<li>@param：函数的形参（多个）。</li>
<li>@return：函数返回值（多个）。</li>
<li>@raise：此函数抛出未处理的错误。</li>
<li>@local：显式将函数标记为未导出（除非 <code>--all</code> ）</li>
<li>@see：参考其他文档条目。</li>
<li>@usage：函数使用示例。（与 <code>@module</code> 共用是有不同含义）。</li>
<li>@table：Lua table。</li>
<li>@field：table 命名成员。</li>
<li>@section： 开始一个命名 section，用于将函数或表分组在一起。</li>
<li>@type：描述类的 section。</li>
<li>@within：将函数或表放入隐式 section。</li>
<li>@fixme，@todo 和 @warning 是批注，是出现在函数内的文档注释。</li>
</ul>
</div>
</div>

<div id="outline-container-orgd5d0b79" class="outline-3">
<h3 id="orgd5d0b79"><span class="section-number-3">2.3</span> 模块</h3>
<div class="outline-text-3" id="text-2-3">
<p>
模块首要的应该是名称和描述。以下是 Lua 5.2 中常用的模块编写方式，顶部带有引入了名称 <code>@module</code> 标记：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">a test module</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@module test</span>

<span style="color: #a1db00;">local</span> <span style="color: #ff8700;">test</span> = {}

<span style="color: #a1db00;">function</span> <span style="color: #ffd700;">test.my_module_function_1</span>()
    ...
<span style="color: #a1db00;">end</span>
...
<span style="color: #a1db00;">return</span> test
</pre>
</div>

<p>
这将设置名为“test”的模块，其描述为“a test module”。
</p>
</div>
</div>

<div id="outline-container-orgd088da8" class="outline-3">
<h3 id="orgd088da8"><span class="section-number-3">2.4</span> 函数</h3>
<div class="outline-text-3" id="text-2-4">
<p>
接下来要描述的是模块中的函数。以下是记录函数的简单示例：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">foo explodes text.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">It is a specialized splitting operation on a string.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@param</span><span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #ff8700;">text</span><span style="color: #6c6c6c; font-style: italic;"> the string</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@return</span><span style="color: #6c6c6c; font-style: italic;"> a table of substrings</span>
<span style="color: #a1db00;">function</span> <span style="color: #ffd700;">foo</span> (text)
....
<span style="color: #a1db00;">end</span>
</pre>
</div>

<p>
还可以显式标记函数名称，这在记录由 C 代码导出的 Lua api 时特别有用：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #6c6c6c; font-style: italic;">/// </span><span style="color: #6c6c6c; font-style: italic;">A C function which is exported to Lua with another name,</span>
<span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">because the ways of C can be mysterious!</span>
<span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">@function our_nice_function</span>
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">_some_function_for_lua</span>(<span style="color: #00d7af;">lua_State</span>* <span style="color: #ff8700;">l</span>) {
    ....
}
</pre>
</div>
<p>
标记基本上添加了所有无法自动从源代码获取的细节。
</p>
</div>
