content/lua/tools/ldoc-manual.org
*** 函数参数和返回值
    =param= 标记带有参数名称，后跟用空格分隔的参数描述。而 =return= 标记后跟返回值的描述：

    #+BEGIN_SRC lua
-- @param name_of_parameter the description of this parameter as verbose text
-- @return the description of the return value

    #+END_SRC

    如果要为参数或返回值指定类型，还有 =tparam= 和 =treturn= ：
    #+BEGIN_SRC lua
-- @tparam string text this parameter is named 'text' and has the fixed type 'string'
-- @treturn {string,...} a table of substrings
    #+END_SRC

    可能有多个 =param= 标记，它们分别对应函数的所有形参。对于 Lua，还可以有多个 =return= 标记。
    #+BEGIN_SRC lua
--- solve a quadratic equation.
-- @param a first coeff
-- @param b second coeff
-- @param c third coeff
-- @return first root, or nil
-- @return second root, or imaginary root error
function solve (a,b,c)
    local disc = b^2 - 4*a*c
    if disc < 0 then
        return nil,"imaginary roots"
    else
       disc = math.sqrt(disc)
       return (-b + disc)/2*a,
              (-b - disc)/2*a
    end
end

...
    #+END_SRC

** 表和常量
   模块还可以导出表和其他值。记录表的经典方法如下所示：
   #+BEGIN_SRC lua
--- a useful table of constants
-- @field alpha first correction
-- @field beta second correction
-- @field gamma fudge factor
-- @table constants
   #+END_SRC
   这里的条目类型由 =table= 标记显式声明；LDoc 还尝试从代码中提取表文档：
   #+BEGIN_SRC lua
--- a useful table of constants
M.constants = {
    alpha = 0.23, -- first correction
    beta = 0.443, -- second correction
    gamma = 0.01  -- fudge factor
}
   #+END_SRC

   此处遵循的规则是 ~NAME = <table-constructor>~ 。 如果 LDoc 无法计算出代码中的名称和类型，则会发出警告，同时指出文件和位置。目前仅支持单级表，并且字段必须是有效标识符。

   另一种模块级类型的 =field= 如下所示：
   #+BEGIN_SRC lua
--- module version.
M._VERSION = '0.5'
   #+END_SRC
   也就是说，模块可以记录导出的函数，本地函数，表和字段。

** 显式指定函数或字段

   当代码分析导致错误类型时，可明确指出来：

   #+BEGIN_SRC lua
--- module contents with explicitly documented field _CONTENTS.
-- @field _CONTENTS
M._CONTENTS = {constants=true,one=true,...}

--- an explicitly named function.
-- @function my_function
function my_function()
    ...
end
   #+END_SRC
   这在 C 中特别有用，其中正在记录的函数声明与最终 Lua api 不同。

** 重复标记
   像 =param= 和 =return= 这样的标记可以多次指定，而像 =function= 这样的类型标记只能在注释中出现一次。

   基本规则是单个文档注释只能记录一个实体。

** 模块别名
   在声明模块内容时，通常使用其本地名称。在这种情况下， =alias= 标记可告诉 LDoc 这些函数确实属于模块：
   #+BEGIN_SRC lua
--- another test.
-- @module test2
-- @alias M

local M = {}

-- first test.
function M.one()
..
end

return M
   #+END_SRC
   LDoc 会自动将代码中的 =M= 和 =_M= 识别为别名，但 =alias= 允许使用任何标识符。

   LDoc 尝试通过检查 doc 注释后面的代码来推断函数名称和形式参数名称。它还识别定义函数的变参：

   #+BEGIN_SRC lua
--- second test.
M.two = function(...) ... end
   #+END_SRC

** 局部函数
   除导出函数外，模块通常包含本地函数。默认情况下，LDoc 不在文档中包含这些，但可以使用 =--all= 标志，或者在 =config.ld= 中使用 ~all = true~ 启用包含。它们可以像全局函数一样记录：
   #+BEGIN_SRC lua
--- it's clear that boo is local from context.
local function boo(...) .. end

local foo

--- we need to give a hint here for foo
-- @local here
function foo(...) .. end
   #+END_SRC

** 声明标记另一种方法
   从 1.3 开始，LDoc 允许使用冒号代替@。
   #+BEGIN_SRC
--- a simple function.
-- string name person's name
-- int: age age of person
-- !person: person object
-- treturn: ?string
-- function check(name,age)
   #+END_SRC

   但是，必须使用 =--colon= 标志或在 =config.ld= 中设置 ~colon=true~ 。 在这种风格中，如果以'！'或'？'为前缀，可以直接使用类型（对于 type-or-nil）

** 要处理的文件
   默认情况下，LDoc 将处理指定目录中以'.lua'或'.luadoc'结尾的任何文件; 也可以处理单个文件。“项目” 通常由一个或多个包中的许多模块组成。生成的 index.html 将指向每个模块生成的文档。

   如果项目只有一个模块或脚本，则生成的 index.html 直接包含该模块的文档，因为指向一个模块的索引是多余的。

   LDoc 具有两级层次结构：在项目下面有模块，脚本，类（包含代码）和示例以及 “主题”（包含文档）。 然后，它们包含函数，表，section 等条目。

   如果要记录脚本，请使用 @script 而不是 @module。新的 1.4 中导出单个类的模块使用 @classmod。

