lua/ldoc-manual.html

<div id="outline-container-orgcdbde87" class="outline-4">
<h4 id="orgcdbde87"><span class="section-number-4">2.4.1</span> 函数参数和返回值</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
<code>param</code> 标记带有参数名称，后跟用空格分隔的参数描述。而 <code>return</code> 标记后跟返回值的描述：
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@param</span><span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #ff8700;">name_of_parameter</span><span style="color: #6c6c6c; font-style: italic;"> the description of this parameter as verbose text</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@return</span><span style="color: #6c6c6c; font-style: italic;"> the description of the return value</span>

</pre>
</div>

<p>
如果要为参数或返回值指定类型，还有 <code>tparam</code> 和 <code>treturn</code> ：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@tparam string text this parameter is named 'text' and has the fixed type 'string'</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@treturn {string,...} a table of substrings</span>
</pre>
</div>

<p>
可能有多个 <code>param</code> 标记，它们分别对应函数的所有形参。对于 Lua，还可以有多个 <code>return</code> 标记。
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">solve a quadratic equation.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@param</span><span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #ff8700;">a</span><span style="color: #6c6c6c; font-style: italic;"> first coeff</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@param</span><span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #ff8700;">b</span><span style="color: #6c6c6c; font-style: italic;"> second coeff</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@param</span><span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #ff8700;">c</span><span style="color: #6c6c6c; font-style: italic;"> third coeff</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@return</span><span style="color: #6c6c6c; font-style: italic;"> first root, or nil</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@return</span><span style="color: #6c6c6c; font-style: italic;"> second root, or imaginary root error</span>
<span style="color: #a1db00;">function</span> <span style="color: #ffd700;">solve</span> (a,b,c)
    <span style="color: #a1db00;">local</span> <span style="color: #ff8700;">disc</span> = b^2 - 4*a*c
    <span style="color: #a1db00;">if</span> disc &lt; 0 <span style="color: #a1db00;">then</span>
        <span style="color: #a1db00;">return</span> <span style="color: #5fafd7;">nil</span>,<span style="color: #ff4ea3;">"imaginary roots"</span>
    <span style="color: #a1db00;">else</span>
       disc = <span style="color: #d18aff;">math</span>.<span style="color: #d18aff;">sqrt</span>(disc)
       <span style="color: #a1db00;">return</span> (-b + disc)/2*a,
              (-b - disc)/2*a
    <span style="color: #a1db00;">end</span>
<span style="color: #a1db00;">end</span>

...
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org54e11cc" class="outline-3">
<h3 id="org54e11cc"><span class="section-number-3">2.5</span> 表和常量</h3>
<div class="outline-text-3" id="text-2-5">
<p>
模块还可以导出表和其他值。记录表的经典方法如下所示：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">a useful table of constants</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@field</span><span style="color: #6c6c6c; font-style: italic;"> alpha first correction</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@field</span><span style="color: #6c6c6c; font-style: italic;"> beta second correction</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@field</span><span style="color: #6c6c6c; font-style: italic;"> gamma fudge factor</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@table constants</span>
</pre>
</div>
<p>
这里的条目类型由 <code>table</code> 标记显式声明；LDoc 还尝试从代码中提取表文档：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">a useful table of constants</span>
M.constants = {
    alpha = 0.23, <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">first correction</span>
    beta = 0.443, <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">second correction</span>
    gamma = 0.01  <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">fudge factor</span>
}
</pre>
</div>

<p>
此处遵循的规则是 <code>NAME = &lt;table-constructor&gt;</code> 。 如果 LDoc 无法计算出代码中的名称和类型，则会发出警告，同时指出文件和位置。目前仅支持单级表，并且字段必须是有效标识符。
</p>

<p>
另一种模块级类型的 <code>field</code> 如下所示：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">module version.</span>
M._VERSION = <span style="color: #ff4ea3;">'0.5'</span>
</pre>
</div>
<p>
也就是说，模块可以记录导出的函数，本地函数，表和字段。
</p>
</div>
</div>

<div id="outline-container-org2425019" class="outline-3">
<h3 id="org2425019"><span class="section-number-3">2.6</span> 显式指定函数或字段</h3>
<div class="outline-text-3" id="text-2-6">
<p>
当代码分析导致错误类型时，可明确指出来：
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">module contents with explicitly documented field _CONTENTS.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@field</span><span style="color: #6c6c6c; font-style: italic;"> _CONTENTS</span>
M._CONTENTS = {constants=<span style="color: #5fafd7;">true</span>,one=<span style="color: #5fafd7;">true</span>,...}

<span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">an explicitly named function.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@function my_function</span>
<span style="color: #a1db00;">function</span> <span style="color: #ffd700;">my_function</span>()
    ...
<span style="color: #a1db00;">end</span>
</pre>
</div>
<p>
这在 C 中特别有用，其中正在记录的函数声明与最终 Lua api 不同。
</p>
</div>
</div>

<div id="outline-container-orgd2bbc86" class="outline-3">
<h3 id="orgd2bbc86"><span class="section-number-3">2.7</span> 重复标记</h3>
<div class="outline-text-3" id="text-2-7">
<p>
像 <code>param</code> 和 <code>return</code> 这样的标记可以多次指定，而像 <code>function</code> 这样的类型标记只能在注释中出现一次。
</p>

<p>
基本规则是单个文档注释只能记录一个实体。
</p>
</div>
</div>

<div id="outline-container-orgaa84449" class="outline-3">
<h3 id="orgaa84449"><span class="section-number-3">2.8</span> 模块别名</h3>
<div class="outline-text-3" id="text-2-8">
<p>
在声明模块内容时，通常使用其本地名称。在这种情况下， <code>alias</code> 标记可告诉 LDoc 这些函数确实属于模块：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">another test.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@module test2</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@alias M</span>

<span style="color: #a1db00;">local</span> <span style="color: #ff8700;">M</span> = {}

<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">first test.</span>
<span style="color: #a1db00;">function</span> <span style="color: #ffd700;">M.one</span>()
..
<span style="color: #a1db00;">end</span>

<span style="color: #a1db00;">return</span> M
</pre>
</div>
<p>
LDoc 会自动将代码中的 <code>M</code> 和 <code>_M</code> 识别为别名，但 <code>alias</code> 允许使用任何标识符。
</p>

<p>
LDoc 尝试通过检查 doc 注释后面的代码来推断函数名称和形式参数名称。它还识别定义函数的变参：
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">second test.</span>
<span style="color: #ffd700;">M.two</span> = <span style="color: #a1db00;">function</span>(...) ... <span style="color: #a1db00;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6058a84" class="outline-3">
<h3 id="org6058a84"><span class="section-number-3">2.9</span> 局部函数</h3>
<div class="outline-text-3" id="text-2-9">
<p>
除导出函数外，模块通常包含本地函数。默认情况下，LDoc 不在文档中包含这些，但可以使用 <code>--all</code> 标志，或者在 <code>config.ld</code> 中使用 <code>all = true</code> 启用包含。它们可以像全局函数一样记录：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">it's clear that boo is local from context.</span>
<span style="color: #a1db00;">local</span> <span style="color: #a1db00;">function</span> <span style="color: #ffd700;">boo</span>(...) .. <span style="color: #a1db00;">end</span>

<span style="color: #a1db00;">local</span> <span style="color: #ff8700;">foo</span>

<span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">we need to give a hint here for foo</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@local here</span>
<span style="color: #a1db00;">function</span> <span style="color: #ffd700;">foo</span>(...) .. <span style="color: #a1db00;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5936d87" class="outline-3">
<h3 id="org5936d87"><span class="section-number-3">2.10</span> 声明标记另一种方法</h3>
<div class="outline-text-3" id="text-2-10">
<p>
从 1.3 开始，LDoc 允许使用冒号代替@。
</p>
<pre class="example">
--- a simple function.
-- string name person's name
-- int: age age of person
-- !person: person object
-- treturn: ?string
-- function check(name,age)
</pre>

<p>
但是，必须使用 <code>--colon</code> 标志或在 <code>config.ld</code> 中设置 <code>colon=true</code> 。 在这种风格中，如果以'！'或'？'为前缀，可以直接使用类型（对于 type-or-nil）
</p>
</div>
</div>

<div id="outline-container-orgfdc8581" class="outline-3">
<h3 id="orgfdc8581"><span class="section-number-3">2.11</span> 要处理的文件</h3>
<div class="outline-text-3" id="text-2-11">
<p>
默认情况下，LDoc 将处理指定目录中以'.lua'或'.luadoc'结尾的任何文件; 也可以处理单个文件。“项目” 通常由一个或多个包中的许多模块组成。生成的 index.html 将指向每个模块生成的文档。
</p>

<p>
如果项目只有一个模块或脚本，则生成的 index.html 直接包含该模块的文档，因为指向一个模块的索引是多余的。
</p>

<p>
LDoc 具有两级层次结构：在项目下面有模块，脚本，类（包含代码）和示例以及 “主题”（包含文档）。 然后，它们包含函数，表，section 等条目。
</p>

<p>
如果要记录脚本，请使用 @script 而不是 @module。新的 1.4 中导出单个类的模块使用 @classmod。
</p>
</div>
</div>
</div>
