content/lua/tools/ldoc-manual.org
* See 引用
  =@see= 用于引用文档的其他部分， =@usage= 可以提供使用示例；可以有多个这样的标记：
  #+BEGIN_SRC lua
---------
-- split a string in two.
-- @param s the string
-- @param delim the delimiter (default space)
-- @return first part
-- @return second part
-- @usage local hello,world = split2("hello world")
-- @see split
funtion split2(s,delim) .. end
  #+END_SRC

  这里假设'split'是在同一模块中定义的函数。如果要链接到另一个模块中的函数，则必须限定引用。

  对方法的引用使用冒号： =myclass:method=; 例如，将如何引用 @type 部分的成员。

  tests/complex 中的示例说明如何解释 @see 引用：
  #+BEGIN_EXAMPLE
  complex.util.parse
  complex.convert.basic
  complex.util
  complex.display
  complex
  #+END_EXAMPLE

  当然可以使用模块或函数的全名，但可以省略顶级命名空间，例如 可以直接引用模块 util 和函数 display.display_that。在模块内部可以直接使用函数名称，例如在 display 中可以 display_this。

  适用于函数的内容也适用于任何模块级项目，如 table。可定义新的模块级项目，它们将根据这些规则工作。

  如果在项目中找不到引用，LDoc 将检查它是否是对 Lua 标准函数或表的引用，并链接到在线 Lua 手册。所以像'table.concat'这样的引用是合理处理的。

  可以使用 =@{ref}= 语法内联引用。 这可能出现在文本的任何地方，并且比 @see 更灵活。 特别是，当该类型具有特定结构时，它提供了一种记录参数类型或返回值的方法：
  #+BEGIN_SRC sh
------
-- extract standard variables.
-- @param s the string
-- @return @{stdvars}
function extract_std(s) ... end

------
-- standard variables.
-- Use @{extract_std} to parse a string containing variables,
-- and @{pack_std} to make such a string.
-- @field length
-- @field duration
-- @field viscosity
-- @table stdvars

  #+END_SRC
  =@{ref}= 对于从代码示例和自述文本引用 API 非常有用。

  通过扩展语法 =@{ref|text}= 更改链接文本。

  也可以在反引号中加入引用，比如 =\`stdvars \`= 。 这通常用于 Markdown 以表示代码，因此在编写文档时自然会出现这种情况。 区别在于反引号表达式不一定是引用，之后将以代码样式出现; 使用 @引用，将收到无法识别的符号的警告，结果将呈现为 “???”。

  它由配置变量 backtick_references 或 backtick 格式控制; 如果在项目中使用 Markdown，则默认值为 true，但可以在 config.ld 中明确指定。

  转义这些引用以便它们不会被扩展，比如 =@{\ref}= 。

** Custom @see References
   定义如何处理项目外部的引用很有用。例如，在 luaposix 项目中，我们希望引用对应 C 函数的 man 说明：
   #+BEGIN_SRC lua
------------
-- raise a signal on this process.
-- @see raise(3)
-- @int nsig
-- @return integer error cod
function raise (nsig)
end
   #+END_SRC
   这些参考引用始终具有此特定形式，任务是将它们转换为 Linux 联机帮助页的在线引用。所以在 config.ld 中有：

   #+BEGIN_SRC lua
local upat = "http://www.kernel.org/doc/man-pages/online/pages/man%s/%s.%s.html"

custom_see_handler('^([%w_]+)%((%d)%)$',function(name,section)
    local url = upat:format(section,name,section)
    local name = name .. '(' ..section..')'
    return name, url
end)
   #+END_SRC

   =^([％w _] +)％((％d)％)$= 匹配模式并提取名称及其 section。然后建立适当的 URL 就很简单了。该函数应返回链接文本和链接源，并在 LDoc 尝试解析项目引用之前检查模式。 所以最好让它们尽可能完全匹配。

* 模块标记
  LDoc 要求有模块文档注释。如果代码样式中的许可证模块看起来像文档注释，那么在配置中设置 ~boilerplate = true~ 跳过它们。

  此注释不必具有显式的 =@module= 标记，LDoc 继续识别 =module()= 的使用。

  有三种类型的 “模块”（例如，项目级）：可使用 =require()= 加载的 module，表明是程序的 script 和 classmod（它是在单个模块中实现的类）。

  有些标记仅在模块注释中有用：author,copyright,license 和 release。它们位于 HTML 的 Info 小节中。

  =@usage= 标记在模块中使用时有不同的含义; 文本按代码字体格式呈现。由于编码完全是为了避免重复以及因重复出现的不同步问题，因此 =@usage= 标记可以在位于模块中后部，出现在长字符串之前。例如，LDoc 的主脚本是 ldoc.lua，会看到 =@usage= 标记出现在第 36 行，help 字符串之前。

  =@export= 是另一个通常是 “分离” 的模块标记。它用于支持在模块最后明确导出函数。在该示例中，question and answer 都是 local，因此对模块是私有的，但是已经明确地导出了 answer。 （如果在此文件上使用 =-a= 标志调用 LDoc，将看到未导出函数的文档。）

  =@set= 是一个功能强大的标记，它为仅用于此模块的变量设置值。在模块注释中 ~@set no_summary = true~ 将在扩展模板时暂时禁用生成摘要。通常，影响模板扩展的配置变量可以这种方式修改。例如，如果希望对特定模块的内容进行排序，那么 ~@set sort = true~ 将仅为该模块执行此操作。

* sections
  LDoc 支持显式 section。 默认情况下，隐式 section 对应于模块中预先存在的类型：'Functions'，'Tables'和'Fields'（还有另一个默认部分'Local Functions'，只有在使用 =--all= 调用 LDoc 时才会出现。）但是可以添加新的部分; 第一种机制是定义新类型（比如'宏'）。 然后创建一个新的部分（'宏'）来包含这些类型。

  还有一种方法可以使用 @section 标记声明 ad-hoc section。 当模块有许多需要放入逻辑部分的函数时，就会出现这种情况。

  #+BEGIN_SRC lua
--- File functions.
-- Useful utilities for opening foobar format files.
-- @section file

--- open a file
...

--- read a file
...

--- Encoding operations.
-- Encoding foobar output in different ways.
-- @section encoding

...
  #+END_SRC
  section 文档注释与普通文档注释具有相同的结构; 摘要用作新的部分标题，描述将在该部分的函数详细信息的开头输出; 该名称未使用，但必须是唯一的。

  section 显式在左侧的 “Contents” 下。有关其外观的示例，请参阅 [[http://stevedonovan.github.com/winapi/api.html][winapi 文档]]。

  可以说模块编写者不应该编写这么长的模块，但是文档工具的工作不是限制程序员！

  一种特殊类型的部分是 =type= ：它用于记录类。type section 中的函数（或字段）被认为是该类的方法。

  #+BEGIN_SRC lua
--- A File class.
-- @type File

....
--- get the modification time.
-- @return standard time since epoch
function File:mtime()
...
end
  #+END_SRC
  （在理想的世界中，我们会使用'class'而不是'type'这个词，但这会与 LuaDoc 类标记冲突。）

  section 继续，直到找到下一 section， =@section end= 或文件结尾。

  可以使用 @within 将项目放入隐式部分。这允将相邻函数放在不同的部分中，这样就不必以特定方式 排序代码。

  使用 1.4，还有另一种用于记录类的选项，它是顶级类型 =classmod= x。它适用于在模块中实现的较大类，以及优点是可以将方法放入 section 中。

  有时，模块可能在逻辑上跨越多个文件，这很容易发生在大型文件中。将有一个名为“foo”的主模块和其他需要在该模块上添加功能的文件。如果这些文件具有 =@submodule=  标记，则其内容将放在主模块文档中。但是，当前的限制是必须在子模块之前处理主模块。

  有关其在实践中的工作原理，请参阅 tests/submodule 示例。

