lua/ldoc-manual.html

<div id="outline-container-org3c14250" class="outline-2">
<h2 id="org3c14250"><span class="section-number-2">3</span> See 引用</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>@see</code> 用于引用文档的其他部分， <code>@usage</code> 可以提供使用示例；可以有多个这样的标记：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">---------</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">split a string in two.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@param</span><span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #ff8700;">s</span><span style="color: #6c6c6c; font-style: italic;"> the string</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@param</span><span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #ff8700;">delim</span><span style="color: #6c6c6c; font-style: italic;"> the delimiter (default space)</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@return</span><span style="color: #6c6c6c; font-style: italic;"> first part</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@return</span><span style="color: #6c6c6c; font-style: italic;"> second part</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@usage</span><span style="color: #6c6c6c; font-style: italic;"> local hello,world = split2("hello world")</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@see</span><span style="color: #6c6c6c; font-style: italic;"> split</span>
funtion split2(s,delim) .. <span style="color: #a1db00;">end</span>
</pre>
</div>

<p>
这里假设'split'是在同一模块中定义的函数。如果要链接到另一个模块中的函数，则必须限定引用。
</p>

<p>
对方法的引用使用冒号： <code>myclass:method</code>; 例如，将如何引用 @type 部分的成员。
</p>

<p>
tests/complex 中的示例说明如何解释 @see 引用：
</p>
<pre class="example">
  complex.util.parse
  complex.convert.basic
  complex.util
  complex.display
  complex
</pre>

<p>
当然可以使用模块或函数的全名，但可以省略顶级命名空间，例如 可以直接引用模块 util 和函数 display.display_that。在模块内部可以直接使用函数名称，例如在 display 中可以 display_this。
</p>

<p>
适用于函数的内容也适用于任何模块级项目，如 table。可定义新的模块级项目，它们将根据这些规则工作。
</p>

<p>
如果在项目中找不到引用，LDoc 将检查它是否是对 Lua 标准函数或表的引用，并链接到在线 Lua 手册。所以像'table.concat'这样的引用是合理处理的。
</p>

<p>
可以使用 <code>@{ref}</code> 语法内联引用。 这可能出现在文本的任何地方，并且比 @see 更灵活。 特别是，当该类型具有特定结构时，它提供了一种记录参数类型或返回值的方法：
</p>
<div class="org-src-container">
<pre class="src src-sh">------
-- extract standard variables.
-- @param s the string
-- @return @{stdvars}
<span style="color: #a1db00;">function</span> <span style="color: #ffd700;">extract_std</span>(s) ... end

------
-- standard variables.
-- Use @{extract_std} to parse a string containing variables,
-- and @{pack_std} to make such a string.
-- @field length
-- @field duration
-- @field viscosity
-- @table stdvars

</pre>
</div>
<p>
<code>@{ref}</code> 对于从代码示例和自述文本引用 API 非常有用。
</p>

<p>
通过扩展语法 <code>@{ref|text}</code> 更改链接文本。
</p>

<p>
也可以在反引号中加入引用，比如 <code>\`stdvars \`</code> 。 这通常用于 Markdown 以表示代码，因此在编写文档时自然会出现这种情况。 区别在于反引号表达式不一定是引用，之后将以代码样式出现; 使用 @引用，将收到无法识别的符号的警告，结果将呈现为 “???”。
</p>

<p>
它由配置变量 backtick_references 或 backtick 格式控制; 如果在项目中使用 Markdown，则默认值为 true，但可以在 config.ld 中明确指定。
</p>

<p>
转义这些引用以便它们不会被扩展，比如 <code>@{\ref}</code> 。
</p>
</div>

<div id="outline-container-org6e7ffae" class="outline-3">
<h3 id="org6e7ffae"><span class="section-number-3">3.1</span> Custom @see References</h3>
<div class="outline-text-3" id="text-3-1">
<p>
定义如何处理项目外部的引用很有用。例如，在 luaposix 项目中，我们希望引用对应 C 函数的 man 说明：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">------------</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">raise a signal on this process.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@see</span><span style="color: #6c6c6c; font-style: italic;"> raise(3)</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@int nsig</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@return</span><span style="color: #6c6c6c; font-style: italic;"> integer error cod</span>
<span style="color: #a1db00;">function</span> <span style="color: #ffd700;">raise</span> (nsig)
<span style="color: #a1db00;">end</span>
</pre>
</div>
<p>
这些参考引用始终具有此特定形式，任务是将它们转换为 Linux 联机帮助页的在线引用。所以在 config.ld 中有：
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #a1db00;">local</span> <span style="color: #ff8700;">upat</span> = <span style="color: #ff4ea3;">"http://www.kernel.org/doc/man-pages/online/pages/man%s/%s.%s.html"</span>

custom_see_handler(<span style="color: #ff4ea3;">'^([%w_]+)%((%d)%)$'</span>,<span style="color: #a1db00;">function</span>(name,section)
    <span style="color: #a1db00;">local</span> <span style="color: #ff8700;">url</span> = upat:format(section,name,section)
    <span style="color: #a1db00;">local</span> <span style="color: #ff8700;">name</span> = name .. <span style="color: #ff4ea3;">'('</span> ..section..<span style="color: #ff4ea3;">')'</span>
    <span style="color: #a1db00;">return</span> name, url
<span style="color: #a1db00;">end</span>)
</pre>
</div>

<p>
<code>^([％w _] +)％((％d)％)$</code> 匹配模式并提取名称及其 section。然后建立适当的 URL 就很简单了。该函数应返回链接文本和链接源，并在 LDoc 尝试解析项目引用之前检查模式。 所以最好让它们尽可能完全匹配。
</p>
</div>
</div>
</div>

<div id="outline-container-orgbe3291f" class="outline-2">
<h2 id="orgbe3291f"><span class="section-number-2">4</span> 模块标记</h2>
<div class="outline-text-2" id="text-4">
<p>
LDoc 要求有模块文档注释。如果代码样式中的许可证模块看起来像文档注释，那么在配置中设置 <code>boilerplate = true</code> 跳过它们。
</p>

<p>
此注释不必具有显式的 <code>@module</code> 标记，LDoc 继续识别 <code>module()</code> 的使用。
</p>

<p>
有三种类型的 “模块”（例如，项目级）：可使用 <code>require()</code> 加载的 module，表明是程序的 script 和 classmod（它是在单个模块中实现的类）。
</p>

<p>
有些标记仅在模块注释中有用：author,copyright,license 和 release。它们位于 HTML 的 Info 小节中。
</p>

<p>
<code>@usage</code> 标记在模块中使用时有不同的含义; 文本按代码字体格式呈现。由于编码完全是为了避免重复以及因重复出现的不同步问题，因此 <code>@usage</code> 标记可以在位于模块中后部，出现在长字符串之前。例如，LDoc 的主脚本是 ldoc.lua，会看到 <code>@usage</code> 标记出现在第 36 行，help 字符串之前。
</p>

<p>
<code>@export</code> 是另一个通常是 “分离” 的模块标记。它用于支持在模块最后明确导出函数。在该示例中，question and answer 都是 local，因此对模块是私有的，但是已经明确地导出了 answer。 （如果在此文件上使用 <code>-a</code> 标志调用 LDoc，将看到未导出函数的文档。）
</p>

<p>
<code>@set</code> 是一个功能强大的标记，它为仅用于此模块的变量设置值。在模块注释中 <code>@set no_summary = true</code> 将在扩展模板时暂时禁用生成摘要。通常，影响模板扩展的配置变量可以这种方式修改。例如，如果希望对特定模块的内容进行排序，那么 <code>@set sort = true</code> 将仅为该模块执行此操作。
</p>
</div>
</div>

<div id="outline-container-orgbae3ccc" class="outline-2">
<h2 id="orgbae3ccc"><span class="section-number-2">5</span> sections</h2>
<div class="outline-text-2" id="text-5">
<p>
LDoc 支持显式 section。 默认情况下，隐式 section 对应于模块中预先存在的类型：'Functions'，'Tables'和'Fields'（还有另一个默认部分'Local Functions'，只有在使用 <code>--all</code> 调用 LDoc 时才会出现。）但是可以添加新的部分; 第一种机制是定义新类型（比如'宏'）。 然后创建一个新的部分（'宏'）来包含这些类型。
</p>

<p>
还有一种方法可以使用 @section 标记声明 ad-hoc section。 当模块有许多需要放入逻辑部分的函数时，就会出现这种情况。
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">File functions.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">Useful utilities for opening foobar format files.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@section file</span>

<span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">open a file</span>
...

<span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">read a file</span>
...

<span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">Encoding operations.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">Encoding foobar output in different ways.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@section encoding</span>

...
</pre>
</div>
<p>
section 文档注释与普通文档注释具有相同的结构; 摘要用作新的部分标题，描述将在该部分的函数详细信息的开头输出; 该名称未使用，但必须是唯一的。
</p>

<p>
section 显式在左侧的 “Contents” 下。有关其外观的示例，请参阅 <a href="http://stevedonovan.github.com/winapi/api.html">winapi 文档</a>。
</p>

<p>
可以说模块编写者不应该编写这么长的模块，但是文档工具的工作不是限制程序员！
</p>

<p>
一种特殊类型的部分是 <code>type</code> ：它用于记录类。type section 中的函数（或字段）被认为是该类的方法。
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">A File class.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@type File</span>

....
<span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">get the modification time.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@return</span><span style="color: #6c6c6c; font-style: italic;"> standard time since epoch</span>
<span style="color: #a1db00;">function</span> <span style="color: #ffd700;">File:mtime</span>()
...
<span style="color: #a1db00;">end</span>
</pre>
</div>
<p>
（在理想的世界中，我们会使用'class'而不是'type'这个词，但这会与 LuaDoc 类标记冲突。）
</p>

<p>
section 继续，直到找到下一 section， <code>@section end</code> 或文件结尾。
</p>

<p>
可以使用 @within 将项目放入隐式部分。这允将相邻函数放在不同的部分中，这样就不必以特定方式 排序代码。
</p>

<p>
使用 1.4，还有另一种用于记录类的选项，它是顶级类型 <code>classmod</code> x。它适用于在模块中实现的较大类，以及优点是可以将方法放入 section 中。
</p>

<p>
有时，模块可能在逻辑上跨越多个文件，这很容易发生在大型文件中。将有一个名为“foo”的主模块和其他需要在该模块上添加功能的文件。如果这些文件具有 <code>@submodule</code>  标记，则其内容将放在主模块文档中。但是，当前的限制是必须在子模块之前处理主模块。
</p>

<p>
有关其在实践中的工作原理，请参阅 tests/submodule 示例。
</p>
</div>
</div>
