content/lua/tools/ldoc-manual.org
* 与 LuaDoc 的区别
  LDoc 只产生“module”文档，因此“file”的概念是多余的。

  一个额外的便利是命名实体更容易：
  #+BEGIN_SRC lua
------------
-- a simple module.
-- (LuaDoc)
-- @class module
-- @name simple

  #+END_SRC
  变为
  #+BEGIN_SRC lua
------------
-- a simple module.
-- (LDoc)
-- @module simple

  #+END_SRC
  这是因为类型名称（如'function'，'module'，'table'等）可以用作标记。LDoc 还提供了一种使用配置文件添加新类型（例如 “macro”）的方法，该配置文件可以与源一起提供。 如果厌倦了反复键入'param'，那么你可以为它定义一个别名，比如'p'。 这也可以在配置文件中指定。

  LDoc 也可以使用 C/C++ 文件，因为扩展编写器显然具有与 Lua 模块编写器相同的文档需求。

  LDoc 允许使用 tparam 或 treturn 将 type 附加到参数或返回值，并为文档管理器提供选项使用 Markdown 来解析注释内容。还可包含美化的代码示例，以及将使用 Markdown 渲染并包含经过修饰的代码块的自述文件。

* 添加新 tag
  LDoc 试图忠实于 LuaDoc，但提供了一些扩展。可以定义标记别名，并声明新类型。
  #+BEGIN_SRC lua
--- zero function. Two new ldoc features here; item types
-- can be used directly as tags, and aliases for tags
-- can be defined in config.ld.
-- @function zero_fun
-- @p k1 first
-- @p k2 second
  #+END_SRC

  这里定义了'param'的别名。如果在源码中找到文件 config.ld，则它将作为 Lua 数据加载。例如，以下上述模块的配置提供标题并定义'param'的别名：
  #+BEGIN_SRC lua
title = "testmod docs"
project = "testmod"
alias("p","param")
  #+END_SRC
  可以定义额外的标记类型：
  #+BEGIN_SRC lua
new_type("macro","Macros")
  #+END_SRC
  然后用作任何其他类型：
  #+BEGIN_SRC lua
-----
-- A useful macro. This is an example of a custom type.
-- @macro first_macro
-- @see second_function
  #+END_SRC

  这也将创建一个名为“macro”的新模块部分。 如果新类型有参数或字段，请指定名称：

  #+BEGIN_SRC lua
new_type("macro","Macros",false,"param")
  #+END_SRC

  （第三个参数表示这不是项目级别标记）。可以这样使用：
  #+BEGIN_SRC lua
-----
-- A macro with arguments.
-- @macro second_macro
-- @param x the argument
  #+END_SRC

  参数将显式在“param”小节下。

* 从代码中推断更多
  函数的限定名称将从 doc 注释后面的任何 function 关键字推断出来。然而，LDoc 分析更进一步。

  代替：

  #+BEGIN_SRC lua
--- first table.
-- @table one
-- @field A alpha
-- @field B beta
M.one = {
    A = 1,
    B = 2;
}
  #+END_SRC

  可写作：
  #+BEGIN_SRC lua
--- first table
-- @table one
M.one = {
    A = 1, -- alpha
    B = 2; -- beta
}
  #+END_SRC

  同样，函数参数注释可以直接使用：

  #+BEGIN_SRC lua
------------
-- third function. Can also provide parameter comments inline,
-- provided they follow this pattern.
function mod1.third_function(
    alpha, -- correction A
    beta, -- correction B
    gamma -- factor C
    )
    ...
end
  #+END_SRC
  与往常一样，如果不合适，显式标记可以覆盖此行为。

* 用 C 编写的扩展模块
  LDoc 可以处理 C/C++文件：
  #+BEGIN_SRC c
/***
Create a table with given array and hash slots.
@function createtable
@param narr initial array slots, default 0
@param nrec initial hash slots, default 0
@return the new table
*/
static int l_createtable (lua_State *L) {
....
  #+END_SRC
  =/**= 和 =///= 都被识别为开始注释块。此外，标记将以完全相同的方式处理。有必要住处这是一个具有给定名称的函数，因为这不能从代码中可靠地推断出来。这样的文件需要一个与 lua 完全相同的模块注释。

  可以使用 =config.ld= 中的 =add_language_extension('lc','c')= 之类的调用将未知扩展名与语言相关联。 （目前语言只能是'c'或'lua'。）

  对 C 扩展特别有用的 LDoc 特性是模块合并。如果多个文件都标记为 =@module lib= ，则会生成单个模块库，其中包含来自单独文件的所有文档。为此，请使用 ~merge = true~ 。

  有关完整示例，请参阅 [[https://stevedonovan.github.io/ldoc/examples/mylib.c.html#][mylib.c]].

* 支持 Moonscript
  1.4 引入了 [[http://moonscript.org/][Moonscript]] 的基本支持。Moonscript 模块约定与 Lua 相同，但显式类构造除外。[[https://stevedonovan.github.io/ldoc/examples/list.moon.html#][list.moon]] 显示了 =@classmod= 如何声明导出类的模块，类的元方法和方法隐式放入单独的部分。

