lua/ldoc-manual.html

<div id="outline-container-org8d296d9" class="outline-2">
<h2 id="org8d296d9"><span class="section-number-2">6</span> 与 LuaDoc 的区别</h2>
<div class="outline-text-2" id="text-6">
<p>
LDoc 只产生“module”文档，因此“file”的概念是多余的。
</p>

<p>
一个额外的便利是命名实体更容易：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">------------</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">a simple module.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">(LuaDoc)</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@class</span><span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #ff8700;">module</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@name</span><span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #ff8700;">simple</span>

</pre>
</div>
<p>
变为
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">------------</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">a simple module.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">(LDoc)</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@module simple</span>

</pre>
</div>
<p>
这是因为类型名称（如'function'，'module'，'table'等）可以用作标记。LDoc 还提供了一种使用配置文件添加新类型（例如 “macro”）的方法，该配置文件可以与源一起提供。 如果厌倦了反复键入'param'，那么你可以为它定义一个别名，比如'p'。 这也可以在配置文件中指定。
</p>

<p>
LDoc 也可以使用 C/C++ 文件，因为扩展编写器显然具有与 Lua 模块编写器相同的文档需求。
</p>

<p>
LDoc 允许使用 tparam 或 treturn 将 type 附加到参数或返回值，并为文档管理器提供选项使用 Markdown 来解析注释内容。还可包含美化的代码示例，以及将使用 Markdown 渲染并包含经过修饰的代码块的自述文件。
</p>
</div>
</div>

<div id="outline-container-orgf3084d8" class="outline-2">
<h2 id="orgf3084d8"><span class="section-number-2">7</span> 添加新 tag</h2>
<div class="outline-text-2" id="text-7">
<p>
LDoc 试图忠实于 LuaDoc，但提供了一些扩展。可以定义标记别名，并声明新类型。
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">zero function. Two new ldoc features here; item types</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">can be used directly as tags, and aliases for tags</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">can be defined in config.ld.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@function zero_fun</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@p k1 first</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@p k2 second</span>
</pre>
</div>

<p>
这里定义了'param'的别名。如果在源码中找到文件 config.ld，则它将作为 Lua 数据加载。例如，以下上述模块的配置提供标题并定义'param'的别名：
</p>
<div class="org-src-container">
<pre class="src src-lua">title = <span style="color: #ff4ea3;">"testmod docs"</span>
project = <span style="color: #ff4ea3;">"testmod"</span>
alias(<span style="color: #ff4ea3;">"p"</span>,<span style="color: #ff4ea3;">"param"</span>)
</pre>
</div>
<p>
可以定义额外的标记类型：
</p>
<div class="org-src-container">
<pre class="src src-lua">new_type(<span style="color: #ff4ea3;">"macro"</span>,<span style="color: #ff4ea3;">"Macros"</span>)
</pre>
</div>
<p>
然后用作任何其他类型：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">-----</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">A useful macro. This is an example of a custom type.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@macro first_macro</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@see</span><span style="color: #6c6c6c; font-style: italic;"> second_function</span>
</pre>
</div>

<p>
这也将创建一个名为“macro”的新模块部分。 如果新类型有参数或字段，请指定名称：
</p>

<div class="org-src-container">
<pre class="src src-lua">new_type(<span style="color: #ff4ea3;">"macro"</span>,<span style="color: #ff4ea3;">"Macros"</span>,<span style="color: #5fafd7;">false</span>,<span style="color: #ff4ea3;">"param"</span>)
</pre>
</div>

<p>
（第三个参数表示这不是项目级别标记）。可以这样使用：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">-----</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">A macro with arguments.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@macro second_macro</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@param</span><span style="color: #6c6c6c; font-style: italic;"> </span><span style="color: #ff8700;">x</span><span style="color: #6c6c6c; font-style: italic;"> the argument</span>
</pre>
</div>

<p>
参数将显式在“param”小节下。
</p>
</div>
</div>

<div id="outline-container-org4a5e249" class="outline-2">
<h2 id="org4a5e249"><span class="section-number-2">8</span> 从代码中推断更多</h2>
<div class="outline-text-2" id="text-8">
<p>
函数的限定名称将从 doc 注释后面的任何 function 关键字推断出来。然而，LDoc 分析更进一步。
</p>

<p>
代替：
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">first table.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@table one</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@field</span><span style="color: #6c6c6c; font-style: italic;"> A alpha</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #a1db00;">@field</span><span style="color: #6c6c6c; font-style: italic;"> B beta</span>
M.one = {
    A = 1,
    B = 2;
}
</pre>
</div>

<p>
可写作：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">first table</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@table one</span>
M.one = {
    A = 1, <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">alpha</span>
    B = 2; <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">beta</span>
}
</pre>
</div>

<p>
同样，函数参数注释可以直接使用：
</p>

<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">------------</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">third function. Can also provide parameter comments inline,</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">provided they follow this pattern.</span>
<span style="color: #a1db00;">function</span> <span style="color: #ffd700;">mod1.third_function</span>(
    alpha, <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">correction A</span>
    beta, <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">correction B</span>
    gamma <span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">factor C</span>
    )
    ...
<span style="color: #a1db00;">end</span>
</pre>
</div>
<p>
与往常一样，如果不合适，显式标记可以覆盖此行为。
</p>
</div>
</div>

<div id="outline-container-org40889fe" class="outline-2">
<h2 id="org40889fe"><span class="section-number-2">9</span> 用 C 编写的扩展模块</h2>
<div class="outline-text-2" id="text-9">
<p>
LDoc 可以处理 C/C++文件：
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #6c6c6c; font-style: italic;">/***</span>
<span style="color: #6c6c6c; font-style: italic;">Create a table with given array and hash slots.</span>
<span style="color: #6c6c6c; font-style: italic;">@function createtable</span>
<span style="color: #6c6c6c; font-style: italic;">@param narr initial array slots, default 0</span>
<span style="color: #6c6c6c; font-style: italic;">@param nrec initial hash slots, default 0</span>
<span style="color: #6c6c6c; font-style: italic;">@return the new table</span>
<span style="color: #6c6c6c; font-style: italic;">*/</span>
<span style="color: #a1db00;">static</span> <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">l_createtable</span> (<span style="color: #00d7af;">lua_State</span> *<span style="color: #ff8700;">L</span>) {
....
</pre>
</div>
<p>
<code>/**</code> 和 <code>///</code> 都被识别为开始注释块。此外，标记将以完全相同的方式处理。有必要住处这是一个具有给定名称的函数，因为这不能从代码中可靠地推断出来。这样的文件需要一个与 lua 完全相同的模块注释。
</p>

<p>
可以使用 <code>config.ld</code> 中的 <code>add_language_extension('lc','c')</code> 之类的调用将未知扩展名与语言相关联。 （目前语言只能是'c'或'lua'。）
</p>

<p>
对 C 扩展特别有用的 LDoc 特性是模块合并。如果多个文件都标记为 <code>@module lib</code> ，则会生成单个模块库，其中包含来自单独文件的所有文档。为此，请使用 <code>merge = true</code> 。
</p>

<p>
有关完整示例，请参阅 <a href="https://stevedonovan.github.io/ldoc/examples/mylib.c.html#">mylib.c</a>.
</p>
</div>
</div>

<div id="outline-container-org6a7b0f2" class="outline-2">
<h2 id="org6a7b0f2"><span class="section-number-2">10</span> 支持 Moonscript</h2>
<div class="outline-text-2" id="text-10">
<p>
1.4 引入了 <a href="http://moonscript.org/">Moonscript</a> 的基本支持。Moonscript 模块约定与 Lua 相同，但显式类构造除外。<a href="https://stevedonovan.github.io/ldoc/examples/list.moon.html#">list.moon</a> 显示了 <code>@classmod</code> 如何声明导出类的模块，类的元方法和方法隐式放入单独的部分。
</p>
</div>
</div>
