content/lua/tools/ldoc-manual.org
* 基本使用
  例如，要处理'lua'目录中的所有文件：
  #+BEGIN_SRC sh
$ ldoc lua
output written to doc/
  #+END_SRC

  此后，doc 目录将包含 index.html，它指向 modules 子目录中的各个模块。 =--dir= 标志可以指定生成输出的位置，并确保该目录存在。输出结构类似 LuaDoc：有一个 index.html，各个模块位于 modules 子目录中。这适用于所有项目级类型，因此还会有 scripts, examples and topics 目录。

  如果模块使用 =module(...)= 定义，则必须推导出模块名称。如果 ldoc 是从包的根目录运行的，那么这个推论不需要任何帮助。例如，包是 foo 那么 =ldoc foo= 将按预期工作。如果实际上在 foo 目录中那么 =ldoc -b ..= 将正确推断出模块名称。一个例子是为 LuaDoc 本身生成文档：
  #+BEGIN_SRC sh
$ ldoc -b .. /path/to/luadoc
  #+END_SRC

  如果没有 =-b= 将包的基础目录设置为当前目录的父级，则 =luadoc.config= 之类的隐式模块将错误地放在全局命名空间中。

  对于不使用 =module()= 的新式模块，建议模块注释包含显式的 =@module PACKAGE.NAME= 。如果没有，那么 ldoc 仍将尝试推断模块名称，但可能需要如上所述 =--package/-b= 帮助。

  一个特例就是 =ldoc .= 。然后目录中必须有一个 config.ld 文件，它可以指定文件：
  #+BEGIN_SRC lua
file = "mymod.lua"
title = "mymod documentation"
description = "mymod does some simple but useful things"
  #+END_SRC
  file 当然可以指向目录，就像 =--file= 选项一样。通过允许在配置中明确指定所有内容，此模式使用户可以轻松地构建文档。

  在 =config.ld= 中，file 可以是 Lua 表，包含文件名或目录; 如果它有一个 =exclude= 字段，那么它将用于从列表中排除文件，例如 ={'examples'，exclude = {'examples/slow.lua'}}= 。

  可以使用 -c 标志指定配置文件。配置文件并非必须包含 file 字段，但在这种情况下，LDoc 确实需要命令行上显式指明文件。如果希望将某些默认值应用于所有文档，则此选项非常有用。

* Markdown 支持
  config.ld 中可以使用 ~format='markdown'~ ，并用于处理摘要和描述; 也可以使用 =-f= 标志。这需要 markdown 处理器。LDoc 知道如何使用：
  + markdown.lua 是 Niklas Frykholm 编写的的纯 Lua 处理器。为方便起见，LDoc 附带了 markdown.lua 的副本。
  + lua-discount，更快的替代方案（ =luarocks install lua-discount= ）。lua-discount 使用 C discount Markdown 处理器，它具有比纯 Lua 版本更多的功能，例如 PHP-Extra 样式表。
  + lunamark，另一种纯净的 Lua 处理器，比 markdown 更快，并具有额外的功能（ =luarocks install lunamark= ）。

  可以通过
  #+BEGIN_SRC lua
format ='markdown|discount|lunamark|plain|backticks'
  #+END_SRC

  使用喜欢的处理器，LDoc 将尝试使用它。如果它找不到它，它将寻找其他一个 markdown 处理器; LDoc 自带 markdown.lua，虽然它对于较大的文件来说很慢。
  （译注：但是使用过程中发现这些多个配置并不生效）

  即使默认为 “plain”，也会发生一些最小的处理，特别是空行被视为换行符。如果使用“backticks”格式化程序，那么它相当于在 =config.ld= 中使用 ~process_backticks = true~ ，反引号将扩展为文档链接，如 =@{ref}= ，否则转换为 =<code> ref </code>= 。

  此格式（markdown）适用于所有项目，包括任何自述文件等。可能想要这个'叙述'文档的 Markdown，而不是代码注释的 markdown。 ~plain = true~  将关闭代码格式化。

* 处理单个模块
  =--output= 可用于为输出文件指定不同的名称。这对于指定单个模块文件的特殊情况很有用。这里的索引是多余的，因此生成的单个 HTML 文件包含模块文档。
  #+BEGIN_EXAMPLE
$ ldoc mylib.lua --> results in doc/index.html
$ ldoc --output mylib mylib.lua --> results in doc/mylib.html
$ ldoc --output mylib --dir html mylib.lua --> results in html/mylib.html
  #+END_EXAMPLE

  LDoc 使用的默认 section 是 “Funcitons”，“Table” 和“Field”，对应于内置类型 “function”，“table” 和“field”。 如果 =config.ld= 包含类似 =new_type("macro","Macros")= 的内容，则会添加一个新的 “Macros” section，其中包含 “macro” 类型的条目，“macro”被注册为新的有效标记名称。然后，默认模板按照定义的顺序显式其相应 section 标题下的项目。

* 获得有关模块的帮助
  有一个选项可以简单地转储解析模块的结果。考虑 C 示例 =tests/example/mylib.c=

  #+BEGIN_EXAMPLE
$ ldoc --dump mylib.c
----
module: mylib   A sample C extension.
Demonstrates using ldoc's C/C++ support. Can either use /// or /*** */ etc.

function        createtable(narr, nrec)
Create a table with given array and hash slots.
narr     initial array slots, default 0
nrec     initial hash slots, default 0

function        solve(a, b, c)
Solve a quadratic equation.
a        coefficient of x^2
b        coefficient of x
c        constant
return  {"first root","second root"}
  #+END_EXAMPLE

  这对于快速检查问题很有用;  在这里我们看到 =createable= 没有 =return= 标记。

  LDoc 将数据转储的这一理念更进一步。如果与 =-m= 标志一起使用，它将查找已安装的 Lua 模块并解析它。如果它已经用 LuaDoc 风格标记，那么将得到一个方便的内容摘要：

  #+BEGIN_EXAMPLE
$ ldoc -m pl.pretty
----
module: pl.pretty       Pretty-printing Lua tables.
* read(s) - read a string representation of a Lua table.
* write(tbl, space, not_clever) - Create a string representation of a Lua table.

* dump(t, ...) - Dump a Lua table out to a file or stdout.
  #+END_EXAMPLE

  可以指定完全限定的函数以获取更多信息：

  #+BEGIN_EXAMPLE
$ ldoc -m pl.pretty.write

function        write(tbl, space, not_clever)
create a string representation of a Lua table.
tbl      {table} Table to serialize to a string.
space    {string} (optional) The indent to use.
               Defaults to two spaces.
not_clever       {bool} (optional) Use for plain output, e.g {['key']=1}.
               Defaults to false.
  #+END_EXAMPLE

  LDoc 知道基本的 Lua 库，因此它可以用作方便的控制台手册：
  #+BEGIN_EXAMPLE
$> ldoc -m assert

function        assert(v, message)
Issues an error when the value of its argument `v` is false (i.e.,
 nil or false); otherwise, returns all its arguments.
`message` is an error
 message; when absent, it defaults to "assertion failed!"
v
message
  #+END_EXAMPLE

  感谢 Mitchell 的 [[http://foicica.com/textadept/][Textadept]] 项目，LDoc 为所有标准表提供了一组 =.luadoc= 文件，以及 [[http://keplerproject.github.com/luafilesystem/][LuaFileSystem]] 和 [[http://www.inf.puc-rio.br/~roberto/lpeg/lpeg.html][LPeg]]。

* LDoc 生成的页面的剖析

* 自定义页面

* 示例

* readme 文件
  像所有优秀的 Github 项目一样，Winapi 有一个 readme.md：
  #+BEGIN_SRC lua
readme = "readme.md"
  #+END_SRC

  这属于全局'Topic'部分; 本文档的 “Contents” 是从 readme 的第二级（##）标题生成的。

  readme 始终使用当前的 Markdown 处理器进行处理，但也可能包含 =@{ref}= 引用跳转到文档和示例文件。如果可能，反引号中的任何符号都将作为引用扩展。与 doc 注释一样，指向标准 Lua 函数的链接（如 =@{os.execute}= ）同样生效。除非第一个缩进行是' =@plain='，否则任何代码部分都将以 Lua 的形式打印出来。 （请参阅本 readme 的源码，了解它是如何使用的。）

  readme 的另一个名称是 topics，它更具描述性。从 LDoc 1.2 开始，readme/topics 可以是文档列表。它们充当文档的顶级目录。目前，如果想按特定顺序使用它们，请使用类似 =01-introduction.md= 等名称，这些名称可以适当排序。

  文档的第一行可能是 Markdown 的 =＃title= 。如果是这样，则 LDoc 将下一级别视为副标题，通常是第二级 ##。但是如果标题已经是第二级，那么将使用第三级标题 ###，依此类推。这意味着第一个标题必须是相对于后面标题的顶级标题，并且必须从第一行开始。

  像 =@{string.upper}=  这样的引用是明确的，将参考在线 Lua 手册。在像 Penlight 这样的项目中，必须写出完全限定的名称，例如 =@{pl.utils.printf}= ，这很麻烦。第一个简化是使用 package 字段来解析未知引用，在本例中为'pl'。（之前我们讨论了在模块作者希望保持模糊的情况下，如何使用包来告诉 LDoc 基础包在哪里，但它在这里做了双重任务。）进一步的简化来自文档中的 =@lookup= 指令，它必须从它自己的第一列开始。例如，如果在谈论 =pl.utils= ，那么可以说 =@lookup utils= ，然后像 =@{printf}= 这样的引用将正确解析。

  如果查看本文档的源代码，将看到 =@lookup doc.md= ，它允许使用 =@{Readme_files|this}= 直接引用 this 的部分。

  请记住，默认情况下是要解决反引号中的引用; 与 =@references= 不同，如果找不到引用，则不是错误。

  文档的部分（第二级标题）也是参考。您正在阅读的这个特定部分可以通过 =@{doc.md.Readme_files}= 引用-规则是任何非字母字符都用下划线替换。

  任何缩进块都假设是 Lua，除非它们的第一行是 =@plain= 。1.4 版的采用 github markdown 风格的代码块，从三个反引号开始，后面跟一个语言。代码一直持续到找到另外三个反引号：对于 C/C++，语言可以是 c，cpp 或 cxx，其他任何东西都是 Lua。

