lua/ldoc-manual.html

<div id="outline-container-org627e0b7" class="outline-2">
<h2 id="org627e0b7"><span class="section-number-2">11</span> 基本使用</h2>
<div class="outline-text-2" id="text-11">
<p>
例如，要处理'lua'目录中的所有文件：
</p>
<div class="org-src-container">
<pre class="src src-sh">$ ldoc lua
output written to doc/
</pre>
</div>

<p>
此后，doc 目录将包含 index.html，它指向 modules 子目录中的各个模块。 <code>--dir</code> 标志可以指定生成输出的位置，并确保该目录存在。输出结构类似 LuaDoc：有一个 index.html，各个模块位于 modules 子目录中。这适用于所有项目级类型，因此还会有 scripts, examples and topics 目录。
</p>

<p>
如果模块使用 <code>module(...)</code> 定义，则必须推导出模块名称。如果 ldoc 是从包的根目录运行的，那么这个推论不需要任何帮助。例如，包是 foo 那么 <code>ldoc foo</code> 将按预期工作。如果实际上在 foo 目录中那么 <code>ldoc -b ..</code> 将正确推断出模块名称。一个例子是为 LuaDoc 本身生成文档：
</p>
<div class="org-src-container">
<pre class="src src-sh">$ ldoc -b .. /path/to/luadoc
</pre>
</div>

<p>
如果没有 <code>-b</code> 将包的基础目录设置为当前目录的父级，则 <code>luadoc.config</code> 之类的隐式模块将错误地放在全局命名空间中。
</p>

<p>
对于不使用 <code>module()</code> 的新式模块，建议模块注释包含显式的 <code>@module PACKAGE.NAME</code> 。如果没有，那么 ldoc 仍将尝试推断模块名称，但可能需要如上所述 <code>--package/-b</code> 帮助。
</p>

<p>
一个特例就是 <code>ldoc .</code> 。然后目录中必须有一个 config.ld 文件，它可以指定文件：
</p>
<div class="org-src-container">
<pre class="src src-lua">file = <span style="color: #ff4ea3;">"mymod.lua"</span>
title = <span style="color: #ff4ea3;">"mymod documentation"</span>
description = <span style="color: #ff4ea3;">"mymod does some simple but useful things"</span>
</pre>
</div>
<p>
file 当然可以指向目录，就像 <code>--file</code> 选项一样。通过允许在配置中明确指定所有内容，此模式使用户可以轻松地构建文档。
</p>

<p>
在 <code>config.ld</code> 中，file 可以是 Lua 表，包含文件名或目录; 如果它有一个 <code>exclude</code> 字段，那么它将用于从列表中排除文件，例如 <code>{'examples'，exclude = {'examples/slow.lua'}}</code> 。
</p>

<p>
可以使用 -c 标志指定配置文件。配置文件并非必须包含 file 字段，但在这种情况下，LDoc 确实需要命令行上显式指明文件。如果希望将某些默认值应用于所有文档，则此选项非常有用。
</p>
</div>
</div>

<div id="outline-container-orgae1fbe1" class="outline-2">
<h2 id="orgae1fbe1"><span class="section-number-2">12</span> Markdown 支持</h2>
<div class="outline-text-2" id="text-12">
<p>
config.ld 中可以使用 <code>format='markdown'</code> ，并用于处理摘要和描述; 也可以使用 <code>-f</code> 标志。这需要 markdown 处理器。LDoc 知道如何使用：
</p>
<ul class="org-ul">
<li>markdown.lua 是 Niklas Frykholm 编写的的纯 Lua 处理器。为方便起见，LDoc 附带了 markdown.lua 的副本。</li>
<li>lua-discount，更快的替代方案（ <code>luarocks install lua-discount</code> ）。lua-discount 使用 C discount Markdown 处理器，它具有比纯 Lua 版本更多的功能，例如 PHP-Extra 样式表。</li>
<li>lunamark，另一种纯净的 Lua 处理器，比 markdown 更快，并具有额外的功能（ <code>luarocks install lunamark</code> ）。</li>
</ul>

<p>
可以通过
</p>
<div class="org-src-container">
<pre class="src src-lua">format =<span style="color: #ff4ea3;">'markdown|discount|lunamark|plain|backticks'</span>
</pre>
</div>

<p>
使用喜欢的处理器，LDoc 将尝试使用它。如果它找不到它，它将寻找其他一个 markdown 处理器; LDoc 自带 markdown.lua，虽然它对于较大的文件来说很慢。
（译注：但是使用过程中发现这些多个配置并不生效）
</p>

<p>
即使默认为 “plain”，也会发生一些最小的处理，特别是空行被视为换行符。如果使用“backticks”格式化程序，那么它相当于在 <code>config.ld</code> 中使用 <code>process_backticks = true</code> ，反引号将扩展为文档链接，如 <code>@{ref}</code> ，否则转换为 <code>&lt;code&gt; ref &lt;/code&gt;</code> 。
</p>

<p>
此格式（markdown）适用于所有项目，包括任何自述文件等。可能想要这个'叙述'文档的 Markdown，而不是代码注释的 markdown。 <code>plain = true</code>  将关闭代码格式化。
</p>
</div>
</div>

<div id="outline-container-org92ff101" class="outline-2">
<h2 id="org92ff101"><span class="section-number-2">13</span> 处理单个模块</h2>
<div class="outline-text-2" id="text-13">
<p>
<code>--output</code> 可用于为输出文件指定不同的名称。这对于指定单个模块文件的特殊情况很有用。这里的索引是多余的，因此生成的单个 HTML 文件包含模块文档。
</p>
<pre class="example">
$ ldoc mylib.lua --&gt; results in doc/index.html
$ ldoc --output mylib mylib.lua --&gt; results in doc/mylib.html
$ ldoc --output mylib --dir html mylib.lua --&gt; results in html/mylib.html
</pre>

<p>
LDoc 使用的默认 section 是 “Funcitons”，“Table” 和“Field”，对应于内置类型 “function”，“table” 和“field”。 如果 <code>config.ld</code> 包含类似 <code>new_type("macro","Macros")</code> 的内容，则会添加一个新的 “Macros” section，其中包含 “macro” 类型的条目，“macro”被注册为新的有效标记名称。然后，默认模板按照定义的顺序显式其相应 section 标题下的项目。
</p>
</div>
</div>

<div id="outline-container-org9000413" class="outline-2">
<h2 id="org9000413"><span class="section-number-2">14</span> 获得有关模块的帮助</h2>
<div class="outline-text-2" id="text-14">
<p>
有一个选项可以简单地转储解析模块的结果。考虑 C 示例 <code>tests/example/mylib.c</code>
</p>

<pre class="example">
$ ldoc --dump mylib.c
----
module: mylib   A sample C extension.
Demonstrates using ldoc's C/C++ support. Can either use /// or /*** */ etc.

function        createtable(narr, nrec)
Create a table with given array and hash slots.
narr     initial array slots, default 0
nrec     initial hash slots, default 0

function        solve(a, b, c)
Solve a quadratic equation.
a        coefficient of x^2
b        coefficient of x
c        constant
return  {"first root","second root"}
</pre>

<p>
这对于快速检查问题很有用;  在这里我们看到 <code>createable</code> 没有 <code>return</code> 标记。
</p>

<p>
LDoc 将数据转储的这一理念更进一步。如果与 <code>-m</code> 标志一起使用，它将查找已安装的 Lua 模块并解析它。如果它已经用 LuaDoc 风格标记，那么将得到一个方便的内容摘要：
</p>

<p>
  #+BEGIN_EXAMPLE
$ ldoc -m pl.pretty
-&#x2014;
module: pl.pretty       Pretty-printing Lua tables.
</p>
</div>
</div>
<div id="outline-container-org9cd4e7a" class="outline-2">
<h2 id="org9cd4e7a"><span class="section-number-2">15</span> read(s) - read a string representation of a Lua table.</h2>
</div>
<div id="outline-container-org7b0bff1" class="outline-2">
<h2 id="org7b0bff1"><span class="section-number-2">16</span> write(tbl, space, not_clever) - Create a string representation of a Lua table.</h2>
</div>

<div id="outline-container-orgd31c592" class="outline-2">
<h2 id="orgd31c592"><span class="section-number-2">17</span> dump(t, &#x2026;) - Dump a Lua table out to a file or stdout.</h2>
<div class="outline-text-2" id="text-17">
<p>
#+END_EXAMPLE
</p>

<p>
可以指定完全限定的函数以获取更多信息：
</p>

<pre class="example">
$ ldoc -m pl.pretty.write

function        write(tbl, space, not_clever)
create a string representation of a Lua table.
tbl      {table} Table to serialize to a string.
space    {string} (optional) The indent to use.
               Defaults to two spaces.
not_clever       {bool} (optional) Use for plain output, e.g {['key']=1}.
               Defaults to false.
</pre>

<p>
LDoc 知道基本的 Lua 库，因此它可以用作方便的控制台手册：
</p>
<pre class="example">
$&gt; ldoc -m assert

function        assert(v, message)
Issues an error when the value of its argument `v` is false (i.e.,
 nil or false); otherwise, returns all its arguments.
`message` is an error
 message; when absent, it defaults to "assertion failed!"
v
message
</pre>

<p>
感谢 Mitchell 的 <a href="http://foicica.com/textadept/">Textadept</a> 项目，LDoc 为所有标准表提供了一组 <code>.luadoc</code> 文件，以及 <a href="http://keplerproject.github.com/luafilesystem/">LuaFileSystem</a> 和 <a href="http://www.inf.puc-rio.br/~roberto/lpeg/lpeg.html">LPeg</a>。
</p>
</div>
</div>

<div id="outline-container-org0360236" class="outline-2">
<h2 id="org0360236"><span class="section-number-2">18</span> LDoc 生成的页面的剖析</h2>
</div>

<div id="outline-container-org140ea7f" class="outline-2">
<h2 id="org140ea7f"><span class="section-number-2">19</span> 自定义页面</h2>
</div>

<div id="outline-container-org545b105" class="outline-2">
<h2 id="org545b105"><span class="section-number-2">20</span> 示例</h2>
</div>

<div id="outline-container-org9f1208f" class="outline-2">
<h2 id="org9f1208f"><span class="section-number-2">21</span> readme 文件</h2>
<div class="outline-text-2" id="text-21">
<p>
像所有优秀的 Github 项目一样，Winapi 有一个 readme.md：
</p>
<div class="org-src-container">
<pre class="src src-lua">readme = <span style="color: #ff4ea3;">"readme.md"</span>
</pre>
</div>

<p>
这属于全局'Topic'部分; 本文档的 “Contents” 是从 readme 的第二级（##）标题生成的。
</p>

<p>
readme 始终使用当前的 Markdown 处理器进行处理，但也可能包含 <code>@{ref}</code> 引用跳转到文档和示例文件。如果可能，反引号中的任何符号都将作为引用扩展。与 doc 注释一样，指向标准 Lua 函数的链接（如 <code>@{os.execute}</code> ）同样生效。除非第一个缩进行是' <code>@plain</code>'，否则任何代码部分都将以 Lua 的形式打印出来。 （请参阅本 readme 的源码，了解它是如何使用的。）
</p>

<p>
readme 的另一个名称是 topics，它更具描述性。从 LDoc 1.2 开始，readme/topics 可以是文档列表。它们充当文档的顶级目录。目前，如果想按特定顺序使用它们，请使用类似 <code>01-introduction.md</code> 等名称，这些名称可以适当排序。
</p>

<p>
文档的第一行可能是 Markdown 的 <code>＃title</code> 。如果是这样，则 LDoc 将下一级别视为副标题，通常是第二级 ##。但是如果标题已经是第二级，那么将使用第三级标题 ###，依此类推。这意味着第一个标题必须是相对于后面标题的顶级标题，并且必须从第一行开始。
</p>

<p>
像 <code>@{string.upper}</code>  这样的引用是明确的，将参考在线 Lua 手册。在像 Penlight 这样的项目中，必须写出完全限定的名称，例如 <code>@{pl.utils.printf}</code> ，这很麻烦。第一个简化是使用 package 字段来解析未知引用，在本例中为'pl'。（之前我们讨论了在模块作者希望保持模糊的情况下，如何使用包来告诉 LDoc 基础包在哪里，但它在这里做了双重任务。）进一步的简化来自文档中的 <code>@lookup</code> 指令，它必须从它自己的第一列开始。例如，如果在谈论 <code>pl.utils</code> ，那么可以说 <code>@lookup utils</code> ，然后像 <code>@{printf}</code> 这样的引用将正确解析。
</p>

<p>
如果查看本文档的源代码，将看到 <code>@lookup doc.md</code> ，它允许使用 <code>@{Readme_files|this}</code> 直接引用 this 的部分。
</p>

<p>
请记住，默认情况下是要解决反引号中的引用; 与 <code>@references</code> 不同，如果找不到引用，则不是错误。
</p>

<p>
文档的部分（第二级标题）也是参考。您正在阅读的这个特定部分可以通过 <code>@{doc.md.Readme_files}</code> 引用-规则是任何非字母字符都用下划线替换。
</p>

<p>
任何缩进块都假设是 Lua，除非它们的第一行是 <code>@plain</code> 。1.4 版的采用 github markdown 风格的代码块，从三个反引号开始，后面跟一个语言。代码一直持续到找到另外三个反引号：对于 C/C++，语言可以是 c，cpp 或 cxx，其他任何东西都是 Lua。
</p>
</div>
</div>
