content/lua/tools/ldoc-manual.org
* 标记修饰符
  任何标签可能有标签修饰符。 例如， ~@param[type=number]~ ，这会将修饰符 type 和值 number 与此特定参数标记相关联。 这个案例常见的是引入了一个简写，即 =@tparam<type><parmname> <comment>=;  以同样的方式可定义 =@treturn= 。

  这对于希望以结构化方式提供 API 的参数和返回值类型的大型项目非常有用，以后可以轻松提取。

  这些类型可以组合，因此 “ =?string|number= ” 表示 “字符串或数字”; “ =?string= ” 是 “ =?|nil|string= ” 的缩写。 但是，对于最后一种情况，通常应使用下面讨论的 opt 修饰符。

  可在 config.ld 中创建使用的新标记有一个很有用的功能：
  #+BEGIN_EXAMPLE
tparam_alias('string','string')
  #+END_EXAMPLE

  也就是说， =@string= 现在与“ =@tparam string= ”具有相同的含义;这也适用于可选类型语法“ =?|T1|T2= ”

  从 1.3 开始，预定义了以下标准类型别名：
  + string
  + number
  + int
  + bool Lua ‘boolean’ type
  + func ‘function’ (using ‘function’ would conflict with the type)
  + tab ‘table’
  + thread

  当使用'colon-lua'（colon.lua）时，可以通过在类型前加上'！'来直接使用它们。 “?”也很自然。

  <type>的确切形式未定义，但这里有一个建议的方案：

  + number — a plain type
  + Bonzo — 已知类型;将生成参考链接
  + {string,number} — 从类型表达式构建的两个值的'list'元组
  + {A=string,N=number} — 一个'结构'，同上（但创建一个命名表并引用它通常更好）
  + {Bonzo,...} — an array of Bonzo objects
  + {[string]=Bonzo,...} — a map of Bonzo objects with string keys
  + Array(Bonzo) — (assuming that Array is a container type)

  配置文件中的 alisa 会被扩展，以便可以将别名标记定义为标记和一组修饰符。所以 tparam 定义为：
  #+BEGIN_EXAMPLE
alias('tparam',{'param',modifiers={type="$1"}})
  #+END_EXAMPLE

  作为扩展，可以在表定义中使用 =@param= 标记。这使得可以使用类型别名（如 =@string= ）来描述字段，因为它们将扩展为“param”。

  LDoc 理解的另一个修饰符是 opt。例如，

  #+BEGIN_EXAMPLE
---- testing [opt]
-- @param one
-- @param[opt] two
-- @param three
-- @param[opt] four
function fun (one,two,three,four)
end
----> displayed as: fun (one [, two], three [, four])
  #+END_EXAMPLE

  更典型的 Lua API 会有一系列可选参数，如下所示：

  #+BEGIN_EXAMPLE
---- a chain of options
-- @param one
-- @param[opt] two
-- @param[optchain] three
-- @param[optchain] four
function fun (one,two,three,four)
end
----> displayed as: fun (one [, two [, three [, four]]])
  #+END_EXAMPLE

  输入有点单调乏味，因此规则是将一系列'opt'修饰符解释为'opt'，'optchain'....。 如果想要显式，那么在 config.ld 中执行 ~convert_opt = true~ 。

  如果为 opt 提供了值，则 LDoc 可以将此值作为此可选参数的默认值。

  此修饰符也可以与类型化的参数别名一起使用。

  #+BEGIN_EXAMPLE
--- a function with typed args.
-- If the Lua function has varargs, then
-- you may document an indefinite number of extra arguments!
-- @string name person's name
-- @int age
-- @string[opt='gregorian'] calender optional calendar
-- @int[opt=0] offset optional offset
-- @treturn string
function one (name,age,...)
end
----> displayed as: one (name, age [, calender='gregorian' [, offset=0]])

  #+END_EXAMPLE

  (See [[https://stevedonovan.github.io/ldoc/examples/four.lua.html#][four.lua]], rendered [[https://stevedonovan.github.io/ldoc/examples/four.lua.html#][here]])

  1.4 中的实验性特征允许定义不同的 “返回组”。 可能有多个 =@return= 标记，并且其含义是明确定义的，因为 Lua 函数可能返回多个值。 但是，作为动态语言，如果成功则可以返回单个值，如果存在错误，则返回两个值（nil，错误消息）。 这实际上是返回 “正常” 错误（如'找不到文件'）而不是参数错误（例如'文件必须是字符串'）的惯例，这些错误通常被引发为错误。

  返回组允许记录器通过指定数字修饰符来指定函数的各种可能返回值。 具有相同数字修饰符的所有返回标记属于一个组：

  #+BEGIN_EXAMPLE
-----
-- function with return groups.
-- @return[1] result
-- @return[2] nil
-- @return[2] error message
function mul1() ... end
  #+END_EXAMPLE

  这是 [[https://stevedonovan.github.io/ldoc/examples/multiple.lua.html#][multiple.lua]] 中的第一个函数，[[https://stevedonovan.github.io/ldoc/examples/multiple.lua.html#][输出]]显示了如何显示返回组，组之间的或关系。

  这是相当笨拙的，因此有一个快捷方式，=@error= 标签可以获得相同的结果，并提供有用的类型信息。

  目前，type，opt 和 <digit> 修饰符是 LDoc 在生成 HTML 输出时已知和使用的唯一修饰符。 但是，允许使用任何其他修饰符，这些修饰符可用于自己的模板或通过自己的工具提取。

* config.ld 中允许的字段
  与相应命令行参数的含义相同的字段：
  + file：包含源码的文件或目录。在 config.ld 中，这也可以是文件和目录的 table。
  + project：项目的项目名称，在左上角用作标题。
  + title: 标题页标题，默认为'Reference'。
  + package：显式包名; 也用于解析文档中的引用。
  + all：在所有文档中显式 local 函数。
  + format：标记处理器，可以是 “plain”（默认），“markdown” 或 “discount”
  + output：输出名称（默认为'index'）
  + dir：输出文件目录（默认为'doc'）
  + colon：使用冒号样式，而不是 @标记样式
  + boilerplate：忽略所有源文件中的第一条注释（例如许可证注释）
  + ext：输出的扩展名（默认为'html'）
  + one：使用单列布局
  + style，template：这些一起指定样式和模板的目录。在 config.ld 中，它们也可能是 true，意味着使用与配置文件相同的目录。
  + merge 允许将来自不同文件的文档合并到没有显式 @submodule 标记的模块中

  只能出现在配置文件中的字段：
  + description：项目标题下使用的简短项目描述
  + full_description：当真的需要更长的项目描述时
  + examples：目录或文件：可以是表
  + readme or topics：自述文件（使用 Markdown 处理）
  + pretty：代码美化'lua'（默认）或'lxsh'
  + prettify_files：也会对源进行美化并与之建立链接; 如果它的值是 “show”，那么也索引源文件。
  + charset：如果要覆盖默认的 UTF-8（文件中是 @charset）
  + sort：按字母顺序排列所有项目
  + no_return_or_parms： 不显式输出中的参数或返回值
  + no_lua_ref： 停止尝试创建对标准 Lua 库的引用
  + backtick_references：是否将解决反引号中的引用。使用 Markdown 时默认情况下会发生。当 explicit 会将反引号中的非引用扩展为 <code> 元素
  + plaint：如果设置了 format 但不希望处理代码注释，该值设置为 true
  + wrap：如果要允许长名称包含在摘要中，该值设置为 true
  + manual_url 指向 Lua 手册的替代或本地位置，例如 “文件：/// d:/dev/lua/projects/lua-5.1.4/doc/manual.html”
  + no_summary：禁止内容摘要
  + custom_tags：定义了一些新标记，这些标记将在功能描述之后显式。格式为 ~{<name>，[title = <name>，} {hidden = false，} {format = nil}}~ 。例如， ~custom_tags = {'remark'，title ='Remarks'}~  将为包含此标记的任何函数的文档添加一个备注部分。format 可以是一个函数， 如果不存在，将使用默认格式化程序，例如，markdown
  + custom_see_handler 用于过滤 see-references 的函数。
  + custom_display_name_handler 用于格式化项目名称的函数。参数是项和用于格式化项名称的函数。例如，要在标记有特定标记的函数旁边显示图标或标记：
    #+BEGIN_SRC lua
-- define a @callback tag:
custom_tags = { { 'callback', hidden = true } }

-- show a label beside functions tagged with @callback.
custom_display_name_handler = function(item, default_handler)
  if item.type == 'function' and item.tags.callback then
    return item.name .. ' [callback]'
  end
  return default_handler(item)
end
    #+END_SRC
  + not_luadoc， 如果文档破坏了 LuaDoc 兼容性，该值设置为 true
  + no_space_before_args：如果您不希望函数名称与其参数之间有空格，则设置为 true。
  + template_escape：覆盖模板中用于 Lua 代码的常用'＃'。例如，如果输出格式为 Markdown，则需要更改此值。

  可用函数包括：
  + alias(a,tag)：为 tags 标记提供别名 a，例如 p 为 param 的 short
  + add_language_extension(ext,lang)：这里 lang 可以是'c'或'lua'，ext 是一个被识别为此语言的扩展名。
  + add_section
  + new_type(tag,header,project_level)用于添加新标记，这些标记放在各自的节头中。它们可能是 “项目级别”。
  + tparam_alias(name,type)：例如可能希望 Object 成为新的标记别名，这意味着 @tparam Object。
  + custom_see_handler(pattern,handler):如果引用与 pattern 匹配，则提取的值将传递给 handler。期望返回链接文本和合适的 URI。（此匹配将在默认处理之前发生）

* 注释和搜索标记
  批注是用于跟踪内部开发状态的特殊标记。已知的注释是'todo'，'fixme'和'warning'。它们可能出现在常规 function/table 的文档注释中，也可能出现在代码中的任何位置。
  #+BEGIN_SRC lua
--- Testing annotations
-- @module annot1
...
--- first function.
-- @todo check if this works!
function annot1.first ()
    if boo then

    end
    --- @fixme what about else?
end
  #+END_SRC
  虽然模板当前不会将其呈现为 HTML，但可以通过 =--tags= 命令提取它们，该命令参数是以逗号分隔的列表。
  #+BEGIN_EXAMPLE
  D:\dev\lua\LDoc\tests> ldoc --tags todo,fixme annot1.lua
  d:\dev\lua\ldoc\tests\annot1.lua:14: first: todo check if this works!
  d:\dev\lua\ldoc\tests\annot1.lua:19: first-fixme1: fixme what about else?
  #+END_EXAMPLE

