lua/ldoc-manual.html

<div id="outline-container-org6c01a1e" class="outline-2">
<h2 id="org6c01a1e"><span class="section-number-2">22</span> 标记修饰符</h2>
<div class="outline-text-2" id="text-22">
<p>
任何标签可能有标签修饰符。 例如， <code>@param[type=number]</code> ，这会将修饰符 type 和值 number 与此特定参数标记相关联。 这个案例常见的是引入了一个简写，即 <code>@tparam&lt;type&gt;&lt;parmname&gt; &lt;comment&gt;</code>;  以同样的方式可定义 <code>@treturn</code> 。
</p>

<p>
这对于希望以结构化方式提供 API 的参数和返回值类型的大型项目非常有用，以后可以轻松提取。
</p>

<p>
这些类型可以组合，因此 “ <code>?string|number</code> ” 表示 “字符串或数字”; “ <code>?string</code> ” 是 “ <code>?|nil|string</code> ” 的缩写。 但是，对于最后一种情况，通常应使用下面讨论的 opt 修饰符。
</p>

<p>
可在 config.ld 中创建使用的新标记有一个很有用的功能：
</p>
<pre class="example">
tparam_alias('string','string')
</pre>

<p>
也就是说， <code>@string</code> 现在与“ <code>@tparam string</code> ”具有相同的含义;这也适用于可选类型语法“ <code>?|T1|T2</code> ”
</p>

<p>
从 1.3 开始，预定义了以下标准类型别名：
</p>
<ul class="org-ul">
<li>string</li>
<li>number</li>
<li>int</li>
<li>bool Lua ‘boolean’ type</li>
<li>func ‘function’ (using ‘function’ would conflict with the type)</li>
<li>tab ‘table’</li>
<li>thread</li>
</ul>

<p>
当使用'colon-lua'（colon.lua）时，可以通过在类型前加上'！'来直接使用它们。 “?”也很自然。
</p>

<p>
&lt;type&gt;的确切形式未定义，但这里有一个建议的方案：
</p>

<ul class="org-ul">
<li>number — a plain type</li>
<li>Bonzo — 已知类型;将生成参考链接</li>
<li>{string,number} — 从类型表达式构建的两个值的'list'元组</li>
<li>{A=string,N=number} — 一个'结构'，同上（但创建一个命名表并引用它通常更好）</li>
<li>{Bonzo,&#x2026;} — an array of Bonzo objects</li>
<li>{[string]=Bonzo,&#x2026;} — a map of Bonzo objects with string keys</li>
<li>Array(Bonzo) — (assuming that Array is a container type)</li>
</ul>

<p>
配置文件中的 alisa 会被扩展，以便可以将别名标记定义为标记和一组修饰符。所以 tparam 定义为：
</p>
<pre class="example">
alias('tparam',{'param',modifiers={type="$1"}})
</pre>

<p>
作为扩展，可以在表定义中使用 <code>@param</code> 标记。这使得可以使用类型别名（如 <code>@string</code> ）来描述字段，因为它们将扩展为“param”。
</p>

<p>
LDoc 理解的另一个修饰符是 opt。例如，
</p>

<pre class="example">
---- testing [opt]
-- @param one
-- @param[opt] two
-- @param three
-- @param[opt] four
function fun (one,two,three,four)
end
----&gt; displayed as: fun (one [, two], three [, four])
</pre>

<p>
更典型的 Lua API 会有一系列可选参数，如下所示：
</p>

<pre class="example">
---- a chain of options
-- @param one
-- @param[opt] two
-- @param[optchain] three
-- @param[optchain] four
function fun (one,two,three,four)
end
----&gt; displayed as: fun (one [, two [, three [, four]]])
</pre>

<p>
输入有点单调乏味，因此规则是将一系列'opt'修饰符解释为'opt'，'optchain'&#x2026;.。 如果想要显式，那么在 config.ld 中执行 <code>convert_opt = true</code> 。
</p>

<p>
如果为 opt 提供了值，则 LDoc 可以将此值作为此可选参数的默认值。
</p>

<p>
此修饰符也可以与类型化的参数别名一起使用。
</p>

<pre class="example">
--- a function with typed args.
-- If the Lua function has varargs, then
-- you may document an indefinite number of extra arguments!
-- @string name person's name
-- @int age
-- @string[opt='gregorian'] calender optional calendar
-- @int[opt=0] offset optional offset
-- @treturn string
function one (name,age,...)
end
----&gt; displayed as: one (name, age [, calender='gregorian' [, offset=0]])

</pre>

<p>
(See <a href="https://stevedonovan.github.io/ldoc/examples/four.lua.html#">four.lua</a>, rendered <a href="https://stevedonovan.github.io/ldoc/examples/four.lua.html#">here</a>)
</p>

<p>
1.4 中的实验性特征允许定义不同的 “返回组”。 可能有多个 <code>@return</code> 标记，并且其含义是明确定义的，因为 Lua 函数可能返回多个值。 但是，作为动态语言，如果成功则可以返回单个值，如果存在错误，则返回两个值（nil，错误消息）。 这实际上是返回 “正常” 错误（如'找不到文件'）而不是参数错误（例如'文件必须是字符串'）的惯例，这些错误通常被引发为错误。
</p>

<p>
返回组允许记录器通过指定数字修饰符来指定函数的各种可能返回值。 具有相同数字修饰符的所有返回标记属于一个组：
</p>

<pre class="example">
-----
-- function with return groups.
-- @return[1] result
-- @return[2] nil
-- @return[2] error message
function mul1() ... end
</pre>

<p>
这是 <a href="https://stevedonovan.github.io/ldoc/examples/multiple.lua.html#">multiple.lua</a> 中的第一个函数，<a href="https://stevedonovan.github.io/ldoc/examples/multiple.lua.html#">输出</a>显示了如何显示返回组，组之间的或关系。
</p>

<p>
这是相当笨拙的，因此有一个快捷方式，=@error= 标签可以获得相同的结果，并提供有用的类型信息。
</p>

<p>
目前，type，opt 和 &lt;digit&gt; 修饰符是 LDoc 在生成 HTML 输出时已知和使用的唯一修饰符。 但是，允许使用任何其他修饰符，这些修饰符可用于自己的模板或通过自己的工具提取。
</p>
</div>
</div>

<div id="outline-container-org12fe14f" class="outline-2">
<h2 id="org12fe14f"><span class="section-number-2">23</span> config.ld 中允许的字段</h2>
<div class="outline-text-2" id="text-23">
<p>
与相应命令行参数的含义相同的字段：
</p>
<ul class="org-ul">
<li>file：包含源码的文件或目录。在 config.ld 中，这也可以是文件和目录的 table。</li>
<li>project：项目的项目名称，在左上角用作标题。</li>
<li>title: 标题页标题，默认为'Reference'。</li>
<li>package：显式包名; 也用于解析文档中的引用。</li>
<li>all：在所有文档中显式 local 函数。</li>
<li>format：标记处理器，可以是 “plain”（默认），“markdown” 或 “discount”</li>
<li>output：输出名称（默认为'index'）</li>
<li>dir：输出文件目录（默认为'doc'）</li>
<li>colon：使用冒号样式，而不是 @标记样式</li>
<li>boilerplate：忽略所有源文件中的第一条注释（例如许可证注释）</li>
<li>ext：输出的扩展名（默认为'html'）</li>
<li>one：使用单列布局</li>
<li>style，template：这些一起指定样式和模板的目录。在 config.ld 中，它们也可能是 true，意味着使用与配置文件相同的目录。</li>
<li>merge 允许将来自不同文件的文档合并到没有显式 @submodule 标记的模块中</li>
</ul>

<p>
只能出现在配置文件中的字段：
</p>
<ul class="org-ul">
<li>description：项目标题下使用的简短项目描述</li>
<li>full_description：当真的需要更长的项目描述时</li>
<li>examples：目录或文件：可以是表</li>
<li>readme or topics：自述文件（使用 Markdown 处理）</li>
<li>pretty：代码美化'lua'（默认）或'lxsh'</li>
<li>prettify_files：也会对源进行美化并与之建立链接; 如果它的值是 “show”，那么也索引源文件。</li>
<li>charset：如果要覆盖默认的 UTF-8（文件中是 @charset）</li>
<li>sort：按字母顺序排列所有项目</li>
<li>no_return_or_parms： 不显式输出中的参数或返回值</li>
<li>no_lua_ref： 停止尝试创建对标准 Lua 库的引用</li>
<li>backtick_references：是否将解决反引号中的引用。使用 Markdown 时默认情况下会发生。当 explicit 会将反引号中的非引用扩展为 &lt;code&gt; 元素</li>
<li>plaint：如果设置了 format 但不希望处理代码注释，该值设置为 true</li>
<li>wrap：如果要允许长名称包含在摘要中，该值设置为 true</li>
<li>manual_url 指向 Lua 手册的替代或本地位置，例如 “文件：/// d:/dev/lua/projects/lua-5.1.4/doc/manual.html”</li>
<li>no_summary：禁止内容摘要</li>
<li>custom_tags：定义了一些新标记，这些标记将在功能描述之后显式。格式为 <code>{&lt;name&gt;，[title = &lt;name&gt;，} {hidden = false，} {format = nil}}</code> 。例如， <code>custom_tags = {'remark'，title ='Remarks'}</code>  将为包含此标记的任何函数的文档添加一个备注部分。format 可以是一个函数， 如果不存在，将使用默认格式化程序，例如，markdown</li>
<li>custom_see_handler 用于过滤 see-references 的函数。</li>
<li><p>
custom_display_name_handler 用于格式化项目名称的函数。参数是项和用于格式化项名称的函数。例如，要在标记有特定标记的函数旁边显示图标或标记：
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">define a @callback tag:</span>
custom_tags = { { <span style="color: #ff4ea3;">'callback'</span>, hidden = <span style="color: #5fafd7;">true</span> } }

<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">show a label beside functions tagged with @callback.</span>
<span style="color: #ffd700;">custom_display_name_handler</span> = <span style="color: #a1db00;">function</span>(item, default_handler)
  <span style="color: #a1db00;">if</span> item.type == <span style="color: #ff4ea3;">'function'</span> <span style="color: #a1db00;">and</span> item.tags.callback <span style="color: #a1db00;">then</span>
    <span style="color: #a1db00;">return</span> item.name .. <span style="color: #ff4ea3;">' [callback]'</span>
  <span style="color: #a1db00;">end</span>
  <span style="color: #a1db00;">return</span> default_handler(item)
<span style="color: #a1db00;">end</span>
</pre>
</div></li>
<li>not_luadoc， 如果文档破坏了 LuaDoc 兼容性，该值设置为 true</li>
<li>no_space_before_args：如果您不希望函数名称与其参数之间有空格，则设置为 true。</li>
<li>template_escape：覆盖模板中用于 Lua 代码的常用'＃'。例如，如果输出格式为 Markdown，则需要更改此值。</li>
</ul>

<p>
可用函数包括：
</p>
<ul class="org-ul">
<li>alias(a,tag)：为 tags 标记提供别名 a，例如 p 为 param 的 short</li>
<li>add_language_extension(ext,lang)：这里 lang 可以是'c'或'lua'，ext 是一个被识别为此语言的扩展名。</li>
<li>add_section</li>
<li>new_type(tag,header,project_level)用于添加新标记，这些标记放在各自的节头中。它们可能是 “项目级别”。</li>
<li>tparam_alias(name,type)：例如可能希望 Object 成为新的标记别名，这意味着 @tparam Object。</li>
<li>custom_see_handler(pattern,handler):如果引用与 pattern 匹配，则提取的值将传递给 handler。期望返回链接文本和合适的 URI。（此匹配将在默认处理之前发生）</li>
</ul>
</div>
</div>

<div id="outline-container-org4e9db30" class="outline-2">
<h2 id="org4e9db30"><span class="section-number-2">24</span> 注释和搜索标记</h2>
<div class="outline-text-2" id="text-24">
<p>
批注是用于跟踪内部开发状态的特殊标记。已知的注释是'todo'，'fixme'和'warning'。它们可能出现在常规 function/table 的文档注释中，也可能出现在代码中的任何位置。
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">Testing annotations</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@module annot1</span>
...
<span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">first function.</span>
<span style="color: #6c6c6c; font-style: italic;">-- </span><span style="color: #6c6c6c; font-style: italic;">@todo check if this works!</span>
<span style="color: #a1db00;">function</span> <span style="color: #ffd700;">annot1.first</span> ()
    <span style="color: #a1db00;">if</span> boo <span style="color: #a1db00;">then</span>

    <span style="color: #a1db00;">end</span>
    <span style="color: #6c6c6c; font-style: italic;">--- </span><span style="color: #6c6c6c; font-style: italic;">@fixme what about else?</span>
<span style="color: #a1db00;">end</span>
</pre>
</div>
<p>
虽然模板当前不会将其呈现为 HTML，但可以通过 <code>--tags</code> 命令提取它们，该命令参数是以逗号分隔的列表。
</p>
<pre class="example">
  D:\dev\lua\LDoc\tests&gt; ldoc --tags todo,fixme annot1.lua
  d:\dev\lua\ldoc\tests\annot1.lua:14: first: todo check if this works!
  d:\dev\lua\ldoc\tests\annot1.lua:19: first-fixme1: fixme what about else?
</pre>
</div>
</div>
