content/lua/tools/ldoc-manual.org
* 生成 HTML
  与 LuaDoc 一样，LDoc 使用模板生成输出 HTML，在本例中为 =ldoc/html/ldoc_ltp.lua= 。 这是由 Rici Lake 最初设计的强大但简单的预处理器扩展的，现在是 [[http://lua-users.org/wiki/SlightlyLessSimpleLuaPreprocessor][Lake]] 的一部分，它现在是 Penlight 的一部分。 有两个规则-任何以'＃'开头的行都是 Lua 代码，也可以嵌入'$(…)'。

  #+BEGIN_EXAMPLE
<h2>Contents</h2>
<ul>
# for kind,items in module.kinds() do
<li><a href="#$(no_spaces(kind))">$(kind)</a></li>
# end
</ul>
  #+END_EXAMPLE

  然后使用 ldoc.css 设置样式。目前模板和样式表基于 LuaDoc，因此结果大致相当; 主要变化是模板更通用。默认位置（由'！'表示）是 ldoc_ltp.lua 的目录。

  注意到内置模板和样式表以 =.lua= 结尾; 这只是为了让 LDoc 更容易找到它们。如果要自定义模板和样式表中的一个或两个，它们将具有其通常的扩展名。

  可以通过指定可与项目一起部署的备用样式表或模板来自定义生成文档的方式。参数是 =--style= 和 =--template= ，它们给出 ldoc.css 和 ldoc.ltp 的目录。如果 config.ld 包含这些变量，则它们的解释会略有不同; 如果它们是 true，那么它意味着'使用与 config.ld 相同的目录'; 否则它们必须是相对于 ldoc 调用的有效目录。

  完全自定义文档的一个例子是 =tests/example/style= ：这就是所谓'minimal Markdown style'的东西，它没有尝试标记内容（强调参数名称除外）。如果写得好的话，单独的叙述就足够了。

  自 1.4 以来，LDoc 中还有其他三种样式表; 第一个是 ldoc_one.css，使用 ~one=true~ ，第二个是 ldoc_pale.css。这是一个较轻的主题，可以从默认的较重颜色一些缓解。可以将此样式与 ~style ="!pale"~ 或 =-s!pale= 一起使用。请参阅 [[http://stevedonovan.github.io/lake/modules/lakelibs.html][Lake]] 文档作为其使用示例。对于 1.4.3，还有 ~style='!fixed'~ ，其中左侧导航面板是固定的，不会与文档的其余部分一起滚动; 可能会发现这有助于在复杂的模块和文档中导航。

  当然，没有理由说 LDoc 必须始终生成 HTML。 =--ext= 定义要使用的输出扩展名; 这也可以在配置文件中设置。因此，可以编写一个将 LDoc 输出转换为 LaTex 的模板。处理和表示的分离使得 LDoc 可以实现这种新的应用。

  从 1.4 开始，LDoc 对生成 Markdown 输出的支持有限，尽管目前仅针对单个文件。为此使用 =--ext md= 。 'ldoc/html/ldoc_md_ltp.lua'定义了 Markdown 的模板，但可以使用上面的模板覆盖它。它是最小结构的另一个例子，提供了一个比相当精细的默认 HTML 模板更好地了解这些模板的地方。

* 内部数据表示

* Footnotes

[fn:1] [[https://stevedonovan.github.io/ldoc/manual/doc.md.html][ldoc manual]]
