lua/ldoc-manual.html

<div id="outline-container-org9f9cf5f" class="outline-2">
<h2 id="org9f9cf5f"><span class="section-number-2">25</span> 生成 HTML</h2>
<div class="outline-text-2" id="text-25">
<p>
与 LuaDoc 一样，LDoc 使用模板生成输出 HTML，在本例中为 <code>ldoc/html/ldoc_ltp.lua</code> 。 这是由 Rici Lake 最初设计的强大但简单的预处理器扩展的，现在是 <a href="http://lua-users.org/wiki/SlightlyLessSimpleLuaPreprocessor">Lake</a> 的一部分，它现在是 Penlight 的一部分。 有两个规则-任何以'＃'开头的行都是 Lua 代码，也可以嵌入'$(…)'。
</p>

<pre class="example">
&lt;h2&gt;Contents&lt;/h2&gt;
&lt;ul&gt;
# for kind,items in module.kinds() do
&lt;li&gt;&lt;a href="#$(no_spaces(kind))"&gt;$(kind)&lt;/a&gt;&lt;/li&gt;
# end
&lt;/ul&gt;
</pre>

<p>
然后使用 ldoc.css 设置样式。目前模板和样式表基于 LuaDoc，因此结果大致相当; 主要变化是模板更通用。默认位置（由'！'表示）是 ldoc_ltp.lua 的目录。
</p>

<p>
注意到内置模板和样式表以 <code>.lua</code> 结尾; 这只是为了让 LDoc 更容易找到它们。如果要自定义模板和样式表中的一个或两个，它们将具有其通常的扩展名。
</p>

<p>
可以通过指定可与项目一起部署的备用样式表或模板来自定义生成文档的方式。参数是 <code>--style</code> 和 <code>--template</code> ，它们给出 ldoc.css 和 ldoc.ltp 的目录。如果 config.ld 包含这些变量，则它们的解释会略有不同; 如果它们是 true，那么它意味着'使用与 config.ld 相同的目录'; 否则它们必须是相对于 ldoc 调用的有效目录。
</p>

<p>
完全自定义文档的一个例子是 <code>tests/example/style</code> ：这就是所谓'minimal Markdown style'的东西，它没有尝试标记内容（强调参数名称除外）。如果写得好的话，单独的叙述就足够了。
</p>

<p>
自 1.4 以来，LDoc 中还有其他三种样式表; 第一个是 ldoc_one.css，使用 <code>one=true</code> ，第二个是 ldoc_pale.css。这是一个较轻的主题，可以从默认的较重颜色一些缓解。可以将此样式与 <code>style ="!pale"</code> 或 <code>-s!pale</code> 一起使用。请参阅 <a href="http://stevedonovan.github.io/lake/modules/lakelibs.html">Lake</a> 文档作为其使用示例。对于 1.4.3，还有 <code>style='!fixed'</code> ，其中左侧导航面板是固定的，不会与文档的其余部分一起滚动; 可能会发现这有助于在复杂的模块和文档中导航。
</p>

<p>
当然，没有理由说 LDoc 必须始终生成 HTML。 <code>--ext</code> 定义要使用的输出扩展名; 这也可以在配置文件中设置。因此，可以编写一个将 LDoc 输出转换为 LaTex 的模板。处理和表示的分离使得 LDoc 可以实现这种新的应用。
</p>

<p>
从 1.4 开始，LDoc 对生成 Markdown 输出的支持有限，尽管目前仅针对单个文件。为此使用 <code>--ext md</code> 。 'ldoc/html/ldoc_md_ltp.lua'定义了 Markdown 的模板，但可以使用上面的模板覆盖它。它是最小结构的另一个例子，提供了一个比相当精细的默认 HTML 模板更好地了解这些模板的地方。
</p>
</div>
</div>

<div id="outline-container-org6f3c54b" class="outline-2">
<h2 id="org6f3c54b"><span class="section-number-2">26</span> 内部数据表示</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-08-13 二 10:42</p>
<p class="validation"></p>
</div>
</body>
</html>
